

<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>如何写邮件 | 技术博客</title>
  <meta name="author" content="Joseph">
  
  <meta name="description" content="部门的技术博客">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="如何写邮件"/>
  <meta property="og:site_name" content="技术博客"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon" type="image/x-ico">
  <link rel="alternate" href="http://wisdombud.github.io/atom.xml" title="技术博客" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//libs.baidu.com/jquery/1.8.0/jquery.min.js"></script>
</head>


<body>
  <header id="header" class="inner">
<div class="alignleft">
  <h1><a href="/">技术博客</a></h1>
  <h2><a href="/">慧萌信安互联网</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">归档</a></li>
    
	<li> <a href="/atom.xml">RSS</a> </li>
<li> <a title="把这个链接拖到你的Chrome收藏夹工具栏中" href='javascript:(function() {
	function c() {
		var e = document.createElement("link");
		e.setAttribute("type", "text/css");
		e.setAttribute("rel", "stylesheet");
		e.setAttribute("href", f);
		e.setAttribute("class", l);
		document.body.appendChild(e)
	}
 
	function h() {
		var e = document.getElementsByClassName(l);
		for (var t = 0; t < e.length; t++) {
			document.body.removeChild(e[t])
		}
	}
 
	function p() {
		var e = document.createElement("div");
		e.setAttribute("class", a);
		document.body.appendChild(e);
		setTimeout(function() {
			document.body.removeChild(e)
		}, 100)
	}
 
	function d(e) {
		return {
			height : e.offsetHeight,
			width : e.offsetWidth
		}
	}
 
	function v(i) {
		var s = d(i);
		return s.height > e && s.height < n && s.width > t && s.width < r
	}
 
	function m(e) {
		var t = e;
		var n = 0;
		while (!!t) {
			n += t.offsetTop;
			t = t.offsetParent
		}
		return n
	}
 
	function g() {
		var e = document.documentElement;
		if (!!window.innerWidth) {
			return window.innerHeight
		} else if (e && !isNaN(e.clientHeight)) {
			return e.clientHeight
		}
		return 0
	}
 
	function y() {
		if (window.pageYOffset) {
			return window.pageYOffset
		}
		return Math.max(document.documentElement.scrollTop, document.body.scrollTop)
	}
 
	function E(e) {
		var t = m(e);
		return t >= w && t <= b + w
	}
 
	function S() {
		var e = document.createElement("audio");
		e.setAttribute("class", l);
		e.src = i;
		e.loop = false;
		e.addEventListener("canplay", function() {
			setTimeout(function() {
				x(k)
			}, 500);
			setTimeout(function() {
				N();
				p();
				for (var e = 0; e < O.length; e++) {
					T(O[e])
				}
			}, 15500)
		}, true);
		e.addEventListener("ended", function() {
			N();
			h()
		}, true);
		e.innerHTML = " <p>If you are reading this, it is because your browser does not support the audio element. We recommend that you get a new browser.</p> <p>";
		document.body.appendChild(e);
		e.play()
	}
 
	function x(e) {
		e.className += " " + s + " " + o
	}
 
	function T(e) {
		e.className += " " + s + " " + u[Math.floor(Math.random() * u.length)]
	}
 
	function N() {
		var e = document.getElementsByClassName(s);
		var t = new RegExp("\\b" + s + "\\b");
		for (var n = 0; n < e.length; ) {
			e[n].className = e[n].className.replace(t, "")
		}
	}
 
	var e = 30;
	var t = 30;
	var n = 350;
	var r = 350;
	var i = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake.mp3";
	var s = "mw-harlem_shake_me";
	var o = "im_first";
	var u = ["im_drunk", "im_baked", "im_trippin", "im_blown"];
	var a = "mw-strobe_light";
	var f = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake-style.css";
	var l = "mw_added_css";
	var b = g();
	var w = y();
	var C = document.getElementsByTagName("*");
	var k = null;
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			if (E(A)) {
				k = A;
				break
			}
		}
	}
	if (A === null) {
		console.warn("Could not find a node of the right size. Please try a different page.");
		return
	}
	c();
	S();
	var O = [];
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			O.push(A)
		}
	}
})()    '>High一下</a> </li>

  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div></header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <div class="post-content">
    <header>
      
  
    <h1 class="title">如何写邮件</h1>
  

      
        <div class="icon"></div>
        <p style="font-family: Helvetica Neue, Helvetica, Arial, "Hiragino Sans GB", sans-serif;">
           <span style=" display: block;  margin: 10px 0; ">
 	时间：<time style="display:inline" datetime="2016-03-30T08:38:35.000Z">2016-03-30</time></span>
        
          <span style=" display: block;  margin: 10px 0; ">作者：joseph</span>
        
      

    </header>
    <div class="entry">
      
        <h2 id="&#x5173;&#x4E8E;&#x4E3B;&#x9898;"><a href="#&#x5173;&#x4E8E;&#x4E3B;&#x9898;" class="headerlink" title="&#x5173;&#x4E8E;&#x4E3B;&#x9898;"></a>&#x5173;&#x4E8E;&#x4E3B;&#x9898;</h2><blockquote>
<p>&#x4E3B;&#x9898;&#x662F;&#x63A5;&#x6536;&#x8005;&#x4E86;&#x89E3;&#x90AE;&#x4EF6;&#x7684;&#x7B2C;&#x4E00;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x63D0;&#x7EB2;&#x6308;&#x9886;&#xFF0C;&#x4F7F;&#x7528;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E3B;&#x9898;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x6536;&#x4EF6;&#x4EBA;&#x8FC5;&#x901F;&#x4E86;&#x89E3;&#x90AE;&#x4EF6;&#x5185;&#x5BB9;&#x5E76;&#x5224;&#x65AD;&#x5176;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
<ol>
<li>&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x7A7A;&#x767D;&#x6807;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x5931;&#x793C;&#x7684;</li>
<li>&#x6807;&#x9898;&#x8981;&#x7B80;&#x77ED;&#xFF0C;&#x4E0D;&#x5B9C;&#x5197;&#x957F;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;Outlook&#x7528;&#x2026;&#x624D;&#x80FD;&#x663E;&#x793A;&#x5B8C;&#x4F60;&#x7684;&#x6807;&#x9898;</li>
<li>&#x6807;&#x9898;&#x8981;&#x80FD;&#x771F;&#x53CD;&#x6620;&#x6587;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x5207;&#x5FCC;&#x4F7F;&#x7528;&#x542B;&#x4E49;&#x4E0D;&#x6E05;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x5982;&#x201C;&#x738B;&#x5148;&#x751F;&#x6536;&#x201D;</li>
<li>&#x4E00;&#x5C01;&#x4FE1;&#x5C3D;&#x53EF;&#x80FD;&#x53EA;&#x9488;&#x5BF9;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x4E0D;&#x5728;&#x4E00;&#x5C01;&#x4FE1;&#x5185;&#x8C08;&#x53CA;&#x591A;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x65E5;&#x540E;&#x6574;&#x7406;</li>
<li>&#x53EF;&#x9002;&#x5F53;&#x7528;&#x4F7F;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x6216;&#x7279;&#x6B8A;&#x5B57;&#x7B26;(&#x5982;&#x201C;*!&#x201D;&#x7B49;)&#x6765;&#x7A81;&#x51FA;&#x6807;&#x9898;&#xFF0C;&#x5F15;&#x8D77;&#x6536;&#x4EF6;&#x4EBA;&#x6CE8;&#x610F;&#xFF0C;&#x4F46;&#x5E94;&#x9002;&#x5EA6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x5C31;&#x7528;&#x201C;&#x7D27;&#x6025;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x5B57;&#x773C;&#x3002;</li>
<li>&#x56DE;&#x590D;&#x5BF9;&#x65B9;&#x90AE;&#x4EF6;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x56DE;&#x590D;&#x5185;&#x5BB9;&#x9700;&#x8981;&#x66F4;&#x6539;&#x6807;&#x9898;&#xFF0C;&#x4E0D;&#x8981;RERE&#x4E00;&#x5927;&#x4E32;&#x3002;</li>
</ol>
</blockquote>
<h2 id="&#x5173;&#x4E8E;&#x79F0;&#x547C;&#x4E0E;&#x95EE;&#x5019;"><a href="#&#x5173;&#x4E8E;&#x79F0;&#x547C;&#x4E0E;&#x95EE;&#x5019;" class="headerlink" title="&#x5173;&#x4E8E;&#x79F0;&#x547C;&#x4E0E;&#x95EE;&#x5019;"></a>&#x5173;&#x4E8E;&#x79F0;&#x547C;&#x4E0E;&#x95EE;&#x5019;</h2><blockquote>
<ol>
<li>&#x6070;&#x5F53;&#x5730;&#x79F0;&#x547C;&#x6536;&#x4EF6;&#x8005;&#xFF0C;&#x62FF;&#x634F;&#x5C3A;&#x5EA6;<br>&#x90AE;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x8981;&#x79F0;&#x547C;&#x6536;&#x4EF6;&#x4EBA;&#x3002;&#x8FD9;&#x65E2;&#x663E;&#x5F97;&#x793C;&#x8C8C;&#xFF0C;&#x4E5F;&#x660E;&#x786E;&#x63D0;&#x9192;&#x67D0;&#x6536;&#x4EF6;&#x4EBA;&#xFF0C;&#x6B64;&#x90AE;&#x4EF6;&#x662F;&#x9762;&#x5411;&#x4ED6;&#x7684;&#xFF0C;&#x8981;&#x6C42;&#x5176;&#x7ED9;&#x51FA;&#x5FC5;&#x8981;&#x7684;&#x56DE;&#x5E94;;&#x5728;&#x591A;&#x4E2A;&#x6536;&#x4EF6;&#x4EBA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x79F0;&#x547C;&#x5927;&#x5BB6;&#x3001;ALL.<br>&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x6709;&#x804C;&#x52A1;&#xFF0C;&#x5E94;&#x6309;&#x804C;&#x52A1;&#x5C0A;&#x79F0;&#x5BF9;&#x65B9;&#xFF0C;&#x5982;&#x201C;x&#x7ECF;&#x7406;&#x201D;;&#x5982;&#x679C;&#x4E0D;&#x6E05;&#x695A;&#x804C;&#x52A1;&#xFF0C;&#x5219;&#x5E94;&#x6309;&#x901A;&#x5E38;&#x7684;&#x201C;x&#x5148;&#x751F;&#x201D;&#x3001;&#x201C;x&#x5C0F;&#x59D0;&#x201D;&#x79F0;&#x547C;&#xFF0C;&#x4F46;&#x8981;&#x628A;&#x6027;&#x522B;&#x5148;&#x641E;&#x6E05;&#x695A;&#x3002;<br>&#x4E0D;&#x719F;&#x6089;&#x7684;&#x4EBA;&#x4E0D;&#x5B9C;&#x76F4;&#x63A5;&#x79F0;&#x547C;&#x82F1;&#x6587;&#x540D;&#xFF0C;&#x5BF9;&#x7EA7;&#x522B;&#x9AD8;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x5B9C;&#x79F0;&#x547C;&#x82F1;&#x6587;&#x540D;&#x3002;&#x79F0;&#x547C;&#x5168;&#x540D;&#x4E5F;&#x662F;&#x4E0D;&#x793C;&#x8C8C;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x902E;&#x8C01;&#x90FD;&#x7528;&#x4E2A;&#x201C;Dearxxx&#x201D;&#xFF0C;&#x663E;&#x5F97;&#x5F88;&#x719F;&#x7EDC;&#x3002;</li>
<li>Email&#x5F00;&#x5934;&#x7ED3;&#x5C3E;&#x6700;&#x597D;&#x8981;&#x6709;&#x95EE;&#x5019;&#x8BED;<br>&#x6700;&#x7B80;&#x5355;&#x7684;&#x5F00;&#x5934;&#x5199;&#x4E00;&#x4E2A;&#x201C;HI&#x201D;&#xFF0C;&#x4E2D;&#x6587;&#x7684;&#x5199;&#x4E2A;&#x201C;&#x4F60;&#x597D;&#x201D;;&#x7ED3;&#x5C3E;&#x5E38;&#x89C1;&#x7684;&#x5199;&#x4E2A;BestRegards&#xFF0C;<br>&#x4E2D;&#x6587;&#x7684;&#x5199;&#x4E2A;&#x201C;&#x795D;&#x60A8;&#x987A;&#x5229;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;<br>&#x4FD7;&#x8BDD;&#x8BF4;&#x5F97;&#x597D;&#xFF0C;&#x201C;&#x793C;&#x591A;&#x4EBA;&#x4E0D;&#x602A;&#x201D;&#xFF0C;&#x793C;&#x8C8C;&#x4E00;&#x4E9B;&#xFF0C;&#x603B;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x5373;&#x4FBF;&#x90AE;&#x4EF6;&#x4E2D;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x4E0D;&#x59A5;&#xFF0C;&#x5BF9;&#x65B9;&#x4E5F;&#x80FD;&#x5E73;&#x9759;&#x7684;&#x770B;&#x5F85;&#x3002;</li>
</ol>
</blockquote>
<h2 id="&#x5173;&#x4E8E;&#x6B63;&#x6587;"><a href="#&#x5173;&#x4E8E;&#x6B63;&#x6587;" class="headerlink" title="&#x5173;&#x4E8E;&#x6B63;&#x6587;"></a>&#x5173;&#x4E8E;&#x6B63;&#x6587;</h2><blockquote>
<ol>
<li>Email&#x6B63;&#x6587;&#x8981;&#x7B80;&#x660E;&#x627C;&#x8981;&#xFF0C;&#x884C;&#x6587;&#x901A;&#x987A;<br>Email&#x6B63;&#x6587;&#x5E94;&#x7B80;&#x660E;&#x627C;&#x8981;&#x7684;&#x8BF4;&#x6E05;&#x695A;&#x4E8B;&#x60C5;;&#x5982;&#x679C;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x786E;&#x5B9E;&#x5F88;&#x591A;&#xFF0C;&#x6B63;&#x6587;&#x5E94;&#x53EA;&#x4F5C;&#x6458;&#x8981;&#x4ECB;&#x7ECD;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x72EC;&#x5199;&#x4E2A;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x9644;&#x4EF6;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x3002;<br>&#x6B63;&#x6587;&#x884C;&#x6587;&#x5E94;&#x901A;&#x987A;&#xFF0C;&#x591A;&#x7528;&#x7B80;&#x5355;&#x8BCD;&#x6C47;&#x548C;&#x77ED;&#x53E5;&#xFF0C;&#x51C6;&#x786E;&#x6E05;&#x6670;&#x7684;&#x8868;&#x8FBE;&#xFF0C;&#x4E0D;&#x8981;&#x51FA;&#x73B0;&#x8BA9;&#x4EBA;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#x7684;&#x8BED;&#x53E5;&#x3002;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x8BA9;&#x4EBA;&#x5BB6;&#x62C9;&#x6EDA;&#x52A8;&#x6761;&#x624D;&#x80FD;&#x770B;&#x5B8C;&#x4F60;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5B66;&#x5510;&#x50E7;&#x3002;</li>
<li>&#x6CE8;&#x610F;Email&#x7684;&#x8BBA;&#x8FF0;&#x8BED;&#x6C14;<br>&#x6839;&#x636E;&#x6536;&#x4EF6;&#x4EBA;&#x4E0E;&#x81EA;&#x5DF1;&#x7684;&#x719F;&#x7EDC;&#x7A0B;&#x5EA6;&#x3001;&#x7B49;&#x7EA7;&#x5173;&#x7CFB;;&#x90AE;&#x4EF6;&#x662F;&#x5BF9;&#x5185;&#x8FD8;&#x662F;&#x5BF9;&#x5916;&#x6027;&#x8D28;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x9009;&#x62E9;&#x6070;&#x5F53;&#x7684;&#x8BED;&#x6C14;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#xFF0C;&#x4EE5;&#x514D;&#x5F15;&#x8D77;&#x5BF9;&#x65B9;&#x4E0D;&#x9002;&#x3002;<br>&#x5C0A;&#x91CD;&#x5BF9;&#x65B9;&#xFF0C;&#x8BF7;&#x3001;&#x8C22;&#x8C22;&#x4E4B;&#x7C7B;&#x7684;&#x8BED;&#x53E5;&#x8981;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x3002;<br>&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x53EF;&#x8F7B;&#x6613;&#x5730;&#x8F6C;&#x7ED9;&#x4ED6;&#x4EBA;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x522B;&#x4EBA;&#x610F;&#x89C1;&#x7684;&#x8BC4;&#x8BBA;&#x5FC5;&#x987B;&#x8C28;&#x614E;&#x800C;&#x5BA2;&#x89C2;&#x3002;&#x201C;&#x90AE;&#x4EF6;&#x95E8;&#x201D;&#x5C31;&#x662F;&#x6DF1;&#x523B;&#x7684;&#x6559;&#x8BAD;!</li>
<li>Email&#x6B63;&#x6587;&#x591A;&#x7528;1234&#x4E4B;&#x7C7B;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x4EE5;&#x6E05;&#x6670;&#x660E;&#x786E;&#x3002;<br>&#x5982;&#x679C;&#x4E8B;&#x60C5;&#x590D;&#x6742;&#xFF0C;&#x6700;&#x597D;1&#x3001;2&#x3001;3&#x3001;4&#x7684;&#x5217;&#x51E0;&#x4E2A;&#x6BB5;&#x843D;&#x8FDB;&#x884C;&#x6E05;&#x6670;&#x660E;&#x786E;&#x7684;&#x8BF4;&#x660E;&#x3002;&#x4FDD;&#x6301;&#x4F60;&#x7684;&#x6BCF;&#x4E2A;&#x6BB5;&#x843D;&#x7B80;&#x77ED;&#x4E0D;&#x5197;&#x957F;&#xFF0C;&#x6CA1;&#x4EBA;&#x6709;&#x65F6;&#x95F4;&#x4ED4;&#x7EC6;&#x770B;&#x4F60;&#x6CA1;&#x5206;&#x6BB5;&#x7684;&#x957F;&#x7BC7;&#x5927;&#x8BBA;&#x3002;</li>
<li>&#x4E00;&#x6B21;&#x90AE;&#x4EF6;&#x4EA4;&#x5F85;&#x5B8C;&#x6574;&#x4FE1;&#x606F;<br>&#x6700;&#x597D;&#x5728;&#x4E00;&#x6B21;&#x90AE;&#x4EF6;&#x4E2D;&#x628A;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x5168;&#x90E8;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x8BF4;&#x51C6;&#x786E;&#x3002;&#x4E0D;&#x8981;&#x8FC7;&#x4E24;&#x5206;&#x949F;&#x4E4B;&#x540E;&#x518D;&#x53D1;&#x4E00;&#x5C01;&#x4EC0;&#x4E48;&#x201C;&#x8865;&#x5145;&#x201D;&#x6216;&#x8005;&#x201C;&#x66F4;&#x6B63;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9;&#x4EBA;&#x5F88;&#x53CD;&#x611F;&#x3002;</li>
<li>&#x5C3D;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x62FC;&#x5199;&#x9519;&#x8BEF;&#x548C;&#x9519;&#x522B;&#x5B57;&#xFF0C;&#x6CE8;&#x610F;&#x4F7F;&#x7528;&#x62FC;&#x5199;&#x68C0;&#x67E5;<br>&#x8FD9;&#x662F;&#x5BF9;&#x522B;&#x4EBA;&#x7684;&#x5C0A;&#x91CD;&#xFF0C;&#x4E5F;&#x662F;&#x81EA;&#x5DF1;&#x6001;&#x5EA6;&#x7684;&#x4F53;&#x73B0;&#x3002;&#x5982;&#x679C;&#x662F;&#x82F1;&#x6587;Email&#xFF0C;&#x6700;&#x597D;&#x628A;&#x62FC;&#x5199;&#x68C0;&#x67E5;&#x529F;&#x80FD;&#x6253;&#x5F00;;&#x5982;&#x679C;&#x662F;&#x4E2D;&#x6587;Email&#xFF0C;&#x6CE8;&#x610F;&#x62FC;&#x97F3;&#x8F93;&#x5165;&#x6CD5;&#x5E26;&#x7ED9;&#x4F60;&#x7684;&#x5F31;&#x667A;&#x540C;&#x97F3;&#x522B;&#x5B57;&#x3002;<br>&#x5728;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x4E4B;&#x524D;&#xFF0C;&#x52A1;&#x5FC5;&#x81EA;&#x5DF1;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x4E00;&#x904D;&#xFF0C;&#x68C0;&#x67E5;&#x884C;&#x6587;&#x662F;&#x5426;&#x901A;&#x987A;&#xFF0C;&#x62FC;&#x5199;&#x662F;&#x5426;&#x6709;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x5408;&#x7406;&#x63D0;&#x793A;&#x91CD;&#x8981;&#x4FE1;&#x606F;<br>&#x4E0D;&#x8981;&#x52A8;&#x4E0D;&#x52A8;&#x5C31;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x3001;&#x7C97;&#x4F53;&#x659C;&#x4F53;&#x3001;&#x989C;&#x8272;&#x5B57;&#x4F53;&#x3001;&#x52A0;&#x5927;&#x5B57;&#x53F7;&#x7B49;&#x624B;&#x6BB5;&#x5BF9;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x63D0;&#x793A;&#x3002;&#x5408;&#x7406;&#x7684;&#x63D0;&#x793A;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x8FC7;&#x591A;&#x7684;&#x63D0;&#x793A;&#x5219;&#x4F1A;&#x8BA9;&#x4EBA;&#x6293;&#x4E0D;&#x4F4F;&#x91CD;&#x70B9;&#xFF0C;&#x5F71;&#x54CD;&#x9605;&#x5EA6;&#x3002;</li>
<li>&#x5408;&#x7406;&#x5229;&#x7528;&#x56FE;&#x7247;&#xFF0C;&#x8868;&#x683C;&#x7B49;&#x5F62;&#x5F0F;&#x6765;&#x8F85;&#x52A9;&#x9610;&#x8FF0;<br>&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x5E26;&#x6709;&#x6280;&#x672F;&#x4ECB;&#x7ECD;&#x6216;&#x8BA8;&#x8BBA;&#x6027;&#x8D28;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x5355;&#x7EAF;&#x4EE5;&#x6587;&#x5B57;&#x5F62;&#x5F0F;&#x5F88;&#x96BE;&#x63CF;&#x8FF0;&#x6E05;&#x695A;&#x3002;&#x5982;&#x679C;&#x914D;&#x5408;&#x56FE;&#x8868;&#x52A0;&#x4EE5;&#x9610;&#x8FF0;&#xFF0C;&#x6536;&#x4EF6;&#x4EBA;&#x4E00;&#x5B9A;&#x4F1A;&#x8868;&#x626C;&#x4F60;&#x7684;&#x4F53;&#x8D34;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x52A8;&#x4E0D;&#x52A8;&#x4F7F;&#x7528;&#xFF1A;)&#x4E4B;&#x7C7B;&#x7684;&#x7B11;&#x8138;&#x5B57;&#x7B26;&#xFF0C;&#x5728;&#x5546;&#x52A1;&#x4FE1;&#x51FD;&#x91CC;&#x9762;&#x8FD9;&#x6837;&#x663E;&#x5F97;&#x6BD4;&#x8F83;&#x8F7B;&#x4F7B;<br>BusinessEmail&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x60C5;&#x4E66;&#xFF0C;&#x6240;&#x4EE5;&#xFF1A;)&#x4E4B;&#x7C7B;&#x7684;&#x6700;&#x597D;&#x614E;&#x7528;&#x3002;&#x53EA;&#x7528;&#x5728;&#x67D0;&#x4E9B;&#x4F60;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x51FA;&#x4E00;&#x5B9A;&#x7684;&#x8F7B;&#x677E;&#x6C14;&#x6C1B;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;-&#xFF1A;)</li>
</ol>
</blockquote>
<h2 id="&#x9644;&#x4EF6;"><a href="#&#x9644;&#x4EF6;" class="headerlink" title="&#x9644;&#x4EF6;"></a>&#x9644;&#x4EF6;</h2><blockquote>
<ol>
<li>&#x5982;&#x679C;&#x90AE;&#x4EF6;&#x5E26;&#x6709;&#x9644;&#x4EF6;&#xFF0C;&#x5E94;&#x5728;&#x6B63;&#x6587;&#x91CC;&#x9762;&#x63D0;&#x793A;&#x6536;&#x4EF6;&#x4EBA;&#x67E5;&#x770B;&#x9644;&#x4EF6;</li>
<li>&#x9644;&#x4EF6;&#x6587;&#x4EF6;&#x5E94;&#x6309;&#x6709;&#x610F;&#x4E49;&#x7684;&#x540D;&#x5B57;&#x547D;&#x540D;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x5916;&#x661F;&#x4EBA;&#x624D;&#x770B;&#x61C2;&#x7684;&#x6587;&#x4EF6;&#x540D;</li>
<li>&#x6B63;&#x6587;&#x4E2D;&#x5E94;&#x5BF9;&#x9644;&#x4EF6;&#x5185;&#x5BB9;&#x505A;&#x7B80;&#x8981;&#x8BF4;&#x660E;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5E26;&#x6709;&#x591A;&#x4E2A;&#x9644;&#x4EF6;&#x65F6;</li>
<li>&#x9644;&#x4EF6;&#x6570;&#x76EE;&#x4E0D;&#x5B9C;&#x8D85;&#x8FC7;4&#x4E2A;&#xFF0C;&#x6570;&#x76EE;&#x8F83;&#x591A;&#x65F6;&#x5E94;&#x6253;&#x5305;&#x538B;&#x7F29;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;</li>
<li>&#x5982;&#x679C;&#x9644;&#x4EF6;&#x662F;&#x7279;&#x6B8A;&#x683C;&#x5F0F;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x5728;&#x6B63;&#x6587;&#x4E2D;&#x8BF4;&#x660E;&#x6253;&#x5F00;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x514D;&#x5F71;&#x54CD;&#x4F7F;&#x7528;</li>
<li>&#x5982;&#x679C;&#x9644;&#x4EF6;&#x8FC7;&#x5927;(&#x4E0D;&#x5B9C;&#x8D85;&#x8FC7;2MB)&#xFF0C;&#x5E94;&#x5206;&#x5272;&#x6210;&#x51E0;&#x4E2A;&#x5C0F;&#x6587;&#x4EF6;&#x5206;&#x522B;&#x53D1;&#x9001;</li>
<li>&#x5982;&#x679C;&#x9644;&#x4EF6;&#x5185;&#x5BB9;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x90A3;&#x5C31;&#x522B;&#x53D1;&#x9644;&#x4EF6;&#x4E86;</li>
<li>office&#x7684;&#xFF0C;&#x5C3D;&#x91CF;&#x4F4E;&#x7248;&#x672C;</li>
</ol>
</blockquote>
<h2 id="&#x8BED;&#x8A00;&#x7684;&#x9009;&#x62E9;&#x548C;&#x6C49;&#x5B57;&#x7F16;&#x7801;"><a href="#&#x8BED;&#x8A00;&#x7684;&#x9009;&#x62E9;&#x548C;&#x6C49;&#x5B57;&#x7F16;&#x7801;" class="headerlink" title="&#x8BED;&#x8A00;&#x7684;&#x9009;&#x62E9;&#x548C;&#x6C49;&#x5B57;&#x7F16;&#x7801;"></a>&#x8BED;&#x8A00;&#x7684;&#x9009;&#x62E9;&#x548C;&#x6C49;&#x5B57;&#x7F16;&#x7801;</h2><blockquote>
<p><strong>&#x9009;&#x62E9;&#x4FBF;&#x4E8E;&#x9605;&#x5EA6;&#x7684;&#x5B57;&#x53F7;&#x548C;&#x5B57;&#x4F53;</strong><br>&#x4E2D;&#x6587;&#x8001;&#x5B9E;&#x70B9;&#x7528;&#x5B8B;&#x4F53;&#x6216;&#x65B0;&#x5B8B;&#x4F53;&#xFF0C;&#x82F1;&#x6587;&#x5C31;&#x7528;Verdana&#x6216;Arial&#x5B57;&#x578B;&#xFF0C;&#x5B57;&#x53F7;&#x7528;&#x4E94;&#x53F7;&#x6216;10&#x53F7;&#x5B57;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x662F;&#x7ECF;&#x7814;&#x7A76;&#x8BC1;&#x660E;&#x6700;&#x9002;&#x5408;&#x5728;&#x7EBF;&#x9605;&#x5EA6;&#x7684;&#x5B57;&#x53F7;&#x548C;&#x5B57;&#x4F53;&#x3002;&#x4E0D;&#x8981;&#x7528;&#x7A00;&#x5947;&#x53E4;&#x602A;&#x7684;&#x5B57;&#x4F53;&#x6216;&#x659C;&#x4F53;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x7528;&#x80CC;&#x666F;&#x4FE1;&#x7EB8;&#xFF0C;&#x7279;&#x522B;&#x5BF9;&#x516C;&#x52A1;&#x90AE;&#x4EF6;&#x3002;</p>
</blockquote>
<h2 id="&#x7ED3;&#x5C3E;&#x7B7E;&#x540D;"><a href="#&#x7ED3;&#x5C3E;&#x7B7E;&#x540D;" class="headerlink" title="&#x7ED3;&#x5C3E;&#x7B7E;&#x540D;"></a>&#x7ED3;&#x5C3E;&#x7B7E;&#x540D;</h2><blockquote>
<p>&#x6BCF;&#x5C01;&#x90AE;&#x4EF6;&#x5728;&#x7ED3;&#x5C3E;&#x90FD;&#x5E94;&#x7B7E;&#x540D;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x65B9;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x7684;&#x77E5;&#x9053;&#x53D1;&#x4EF6;&#x4EBA;&#x4FE1;&#x606F;&#x3002;&#x867D;&#x7136;&#x4F60;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x80FD;&#x4ECE;&#x53D1;&#x4EF6;&#x4EBA;&#x4E2D;&#x8BA4;&#x51FA;&#x4F60;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x4E3A;&#x4F60;&#x7684;&#x670B;&#x53CB;&#x8BBE;&#x8BA1;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<ol>
<li>&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E0D;&#x5B9C;&#x8FC7;&#x591A;<br>&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x6D88;&#x606F;&#x672B;&#x5C3E;&#x52A0;&#x4E0A;&#x7B7E;&#x540D;&#x6863;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x7B7E;&#x540D;&#x6863;&#x53EF;&#x5305;&#x62EC;&#x59D3;&#x540D;&#x3001;&#x804C;&#x52A1;&#x3001;&#x516C;&#x53F8;&#x3001;&#x7535;&#x8BDD;&#x3001;&#x4F20;&#x771F;&#x3001;&#x5730;&#x5740;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x4FE1;&#x606F;&#x4E0D;&#x5B9C;&#x884C;&#x6570;&#x8FC7;&#x591A;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x8D85;&#x8FC7;4&#x884C;&#x3002;&#x4F60;&#x53EA;&#x9700;&#x5C06;&#x4E00;&#x4E9B;&#x5FC5;&#x8981;&#x4FE1;&#x606F;&#x653E;&#x5728;&#x4E0A;&#x9762;&#xFF0C;&#x5BF9;&#x65B9;&#x5982;&#x679C;&#x9700;&#x8981;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x81EA;&#x7136;&#x4F1A;&#x4E0E;&#x4F60;&#x8054;&#x7CFB;&#x3002;<br>&#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x77ED;&#x8BED;&#x4F5C;&#x4E3A;&#x4F60;&#x7684;&#x7B7E;&#x540D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x5EA7;&#x53F3;&#x94ED;&#xFF0C;&#x6216;&#x516C;&#x53F8;&#x7684;&#x5BA3;&#x4F20;&#x53E3;&#x53F7;&#x3002;&#x4F46;&#x662F;&#x8981;&#x5206;&#x6E05;&#x6536;&#x4EF6;&#x4EBA;&#x5BF9;&#x8C61;&#x4E0E;&#x573A;&#x5408;&#xFF0C;&#x5207;&#x8BB0;&#x4E00;&#x5B9A;&#x8981;&#x5F97;&#x4F53;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x53EA;&#x7528;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x6863;<br>&#x5BF9;&#x5185;&#x3001;&#x5BF9;&#x79C1;&#x3001;&#x5BF9;&#x719F;&#x6089;&#x7684;&#x5BA2;&#x6237;&#x7B49;&#x7FA4;&#x4F53;&#x7684;&#x90AE;&#x4EF6;&#x5F80;&#x6765;&#xFF0C;&#x7B7E;&#x540D;&#x6863;&#x5E94;&#x8BE5;&#x8FDB;&#x884C;&#x7B80;&#x5316;&#x3002;&#x8FC7;&#x4E8E;&#x6B63;&#x5F0F;&#x7684;&#x7B7E;&#x540D;&#x6863;&#x4F1A;&#x8BA9;&#x4E0E;&#x5BF9;&#x65B9;&#x663E;&#x5F97;&#x758F;&#x8FDC;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;Outlook&#x4E2D;&#x8BBE;&#x7F6E;&#x591A;&#x4E2A;&#x7B7E;&#x540D;&#x6863;&#xFF0C;&#x7075;&#x6D3B;&#x8C03;&#x7528;&#x3002;</li>
<li>&#x7B7E;&#x540D;&#x6863;&#x6587;&#x5B57;&#x5E94;&#x9009;&#x62E9;&#x4E0E;&#x6B63;&#x6587;&#x6587;&#x5B57;&#x5339;&#x914D;&#xFF0C;&#x7B80;&#x4F53;&#x3001;&#x7E41;&#x4F53;&#x6216;&#x82F1;&#x6587;&#xFF0C;&#x4EE5;&#x514D;&#x6210;&#x51FA;&#x73B0;&#x4E71;&#x7801;&#x3002;&#x5B57;&#x53F7;&#x4E00;&#x822C;&#x5E94;&#x9009;&#x62E9;&#x6BD4;&#x6B63;&#x6587;&#x5B57;&#x4F53;&#x5C0F;&#x4E00;&#x4E9B;&#x3002;</li>
</ol>
</blockquote>
<h2 id="&#x56DE;&#x590D;&#x6280;&#x5DE7;"><a href="#&#x56DE;&#x590D;&#x6280;&#x5DE7;" class="headerlink" title="&#x56DE;&#x590D;&#x6280;&#x5DE7;"></a>&#x56DE;&#x590D;&#x6280;&#x5DE7;</h2><blockquote>
<ol>
<li>&#x53CA;&#x65F6;&#x56DE;&#x590D;Email<br>&#x6536;&#x5230;&#x4ED6;&#x4EBA;&#x7684;&#x91CD;&#x8981;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x540E;&#xFF0C;&#x5373;&#x523B;&#x56DE;&#x590D;&#x5BF9;&#x65B9;&#x4E00;&#x4E0B;&#xFF0C;&#x5F80;&#x5F80;&#x8FD8;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x4ED6;&#x4EBA;&#x7684;&#x5C0A;&#x91CD;&#xFF0C;&#x7406;&#x60F3;&#x7684;&#x56DE;&#x590D;&#x65F6;&#x95F4;&#x662F;2&#x5C0F;&#x65F6;&#x5185;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E00;&#x4E9B;&#x7D27;&#x6025;&#x91CD;&#x8981;&#x7684;&#x90AE;&#x4EF6;&#x3002;<br>&#x5BF9;&#x6BCF;&#x4E00;&#x4EFD;&#x90AE;&#x4EF6;&#x90FD;&#x7ACB;&#x5373;&#x5904;&#x7406;&#x662F;&#x5F88;&#x5360;&#x7528;&#x65F6;&#x95F4;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x4F18;&#x5148;&#x7EA7;&#x4F4E;&#x7684;&#x90AE;&#x4EF6;&#x53EF;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x4E00;&#x822C;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;24&#x5C0F;&#x65F6;&#x3002;<br>&#x5982;&#x679C;&#x4E8B;&#x60C5;&#x590D;&#x6742;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x53CA;&#x65F6;&#x786E;&#x5207;&#x56DE;&#x590D;&#xFF0C;&#x90A3;&#x81F3;&#x5C11;&#x5E94;&#x8BE5;&#x53CA;&#x65F6;&#x7684;&#x56DE;&#x590D;&#x8BF4;&#x201C;&#x6536;&#x5230;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x53CA;&#x65F6;&#x56DE;&#x590D;&#xFF0C;&#x4E91;&#x4E91;&#x201D;&#x3002;&#x4E0D;&#x8981;&#x8BA9;&#x5BF9;&#x65B9;&#x82E6;&#x82E6;&#x7B49;&#x5F85;&#xFF0C;&#x8BB0;&#x4F4F;&#xFF1A;&#x53CA;&#x65F6;&#x4F5C;&#x51FA;&#x54CD;&#x5E94;&#xFF0C;&#x54EA;&#x6015;&#x53EA;&#x662F;&#x786E;&#x8BA4;&#x4E00;&#x4E0B;&#x6536;&#x5230;&#x4E86;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x51FA;&#x5DEE;&#x6216;&#x4F11;&#x5047;&#xFF0C;&#x5E94;&#x8BE5;&#x8BBE;&#x5B9A;&#x81EA;&#x52A8;&#x56DE;&#x590D;&#x529F;&#x80FD;&#xFF0C;&#x63D0;&#x793A;&#x53D1;&#x4EF6;&#x4EBA;&#xFF0C;&#x4EE5;&#x514D;&#x5F71;&#x54CD;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8FDB;&#x884C;&#x9488;&#x5BF9;&#x6027;&#x56DE;&#x590D;<br>&#x5F53;&#x56DE;&#x4EF6;&#x7B54;&#x590D;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x597D;&#x628A;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x6284;&#x5230;&#x56DE;&#x4EF6;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x9644;&#x4E0A;&#x7B54;&#x6848;&#x3002;&#x4E0D;&#x8981;&#x7528;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x90A3;&#x6837;&#x592A;&#x751F;&#x786C;&#x4E86;&#xFF0C;&#x5E94;&#x8BE5;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x9610;&#x8FF0;&#xFF0C;&#x8BA9;&#x5BF9;&#x65B9;&#x4E00;&#x6B21;&#x6027;&#x7406;&#x89E3;&#xFF0C;&#x907F;&#x514D;&#x518D;&#x53CD;&#x590D;&#x4EA4;&#x6D41;&#xFF0C;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;&#x3002;</li>
<li>&#x56DE;&#x590D;&#x4E0D;&#x5F97;&#x5C11;&#x4E8E;10&#x4E2A;&#x5B57;<br>&#x5BF9;&#x65B9;&#x7ED9;&#x4F60;&#x53D1;&#x6765;&#x4E00;&#x5927;&#x6BB5;&#x90AE;&#x4EF6;&#xFF0C;&#x4F60;&#x786E;&#x53EA;&#x56DE;&#x590D;&#x201C;&#x662F;&#x7684;&#x201D;&#x3001;&#x201C;&#x5BF9;&#x201D;&#x3001;&#x201C;&#x8C22;&#x8C22;&#x201D;&#x3001;&#x201C;&#x5DF2;&#x77E5;&#x9053;&#x201D;&#x7B49;&#x5B57;&#x773C;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x793C;&#x8C8C;&#x7684;&#x3002;&#x600E;&#x4E48;&#x7740;&#x4E5F;&#x8981;&#x51D1;&#x591F;10&#x4E2A;&#x5B57;&#xFF0C;&#x663E;&#x793A;&#x51FA;&#x4F60;&#x7684;&#x5C0A;&#x91CD;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x5C31;&#x540C;&#x4E00;&#x95EE;&#x9898;&#x591A;&#x6B21;&#x56DE;&#x590D;&#x8BA8;&#x8BBA;&#xFF0C;&#x4E0D;&#x8981;&#x76D6;&#x9AD8;&#x697C;<br>&#x5982;&#x679C;&#x6536;&#x53D1;&#x53CC;&#x65B9;&#x5C31;&#x540C;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x4EA4;&#x6D41;&#x56DE;&#x590D;&#x8D85;&#x8FC7;3&#x6B21;&#xFF0C;&#x8FD9;&#x53EA;&#x80FD;&#x8BF4;&#x660E;&#x4EA4;&#x6D41;&#x4E0D;&#x7545;&#xFF0C;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x3002;&#x6B64;&#x65F6;&#x5E94;&#x91C7;&#x7528;&#x7535;&#x8BDD;&#x6C9F;&#x901A;&#x7B49;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x540E;&#x518D;&#x505A;&#x5224;&#x65AD;&#x3002;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x6709;&#x65F6;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;&#x3002;<br>&#x5BF9;&#x4E8E;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x591A;&#x4E2A;&#x6536;&#x4EF6;&#x4EBA;&#x9891;&#x7E41;&#x56DE;&#x590D;&#xFF0C;&#x53D1;&#x8868;&#x770B;&#x6CD5;&#xFF0C;&#x628A;&#x90AE;&#x4EF6;&#x8D8A;RE&#x8D8A;&#x9AD8;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x90AE;&#x4EF6;&#x8FC7;&#x4E8E;&#x5197;&#x957F;&#x7B28;&#x62D9;&#x800C;&#x4E0D;&#x53EF;&#x9605;&#x8BFB;&#x3002;&#x6B64;&#x65F6;&#x5E94;&#x5373;&#x662F;&#x5BF9;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x5C0F;&#x7ED3;&#xFF0C;&#x5220;&#x51CF;&#x7626;&#x8EAB;&#xFF0C;&#x7A81;&#x51FA;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x8981;&#x533A;&#x5206;Reply&#x548C;ReplyAll(&#x533A;&#x5206;&#x5355;&#x72EC;&#x56DE;&#x590D;&#x548C;&#x56DE;&#x590D;&#x5168;&#x4F53;)<br>&#x5982;&#x679C;&#x53EA;&#x9700;&#x8981;&#x5355;&#x72EC;&#x4E00;&#x4E2A;&#x4EBA;&#x77E5;&#x9053;&#x7684;&#x4E8B;&#xFF0C;&#x5355;&#x72EC;&#x56DE;&#x590D;&#x7ED9;&#x4ED6;&#x4E00;&#x4E2A;&#x4EBA;&#x5C31;&#x884C;&#x4E86;<br>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x53D1;&#x4EF6;&#x4EBA;&#x63D0;&#x51FA;&#x7684;&#x8981;&#x6C42;&#x4F5C;&#x51FA;&#x7ED3;&#x8BBA;&#x54CD;&#x5E94;&#xFF0C;&#x5E94;&#x8BE5;replayall&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;;&#x4E0D;&#x8981;&#x8BA9;&#x5BF9;&#x65B9;&#x5E2E;&#x4F60;&#x5B8C;&#x6210;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x53D1;&#x4EF6;&#x4EBA;&#x7684;&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x6216;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0E;&#x53D1;&#x4EF6;&#x4EBA;&#x5355;&#x72EC;&#x6C9F;&#x901A;&#xFF0C;&#x4E0D;&#x8981;&#x5F53;&#x7740;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x9762;&#xFF0C;&#x4E0D;&#x505C;&#x7684;RE&#x6765;RE&#x53BB;&#xFF0C;&#x4E0E;&#x53D1;&#x4EF6;&#x4EBA;&#x8BA8;&#x8BBA;&#x3002;&#x4F60;&#x4EEC;&#x8BA8;&#x8BBA;&#x597D;&#x4E86;&#x518D;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x3002;&#x4E0D;&#x8981;&#x5411;&#x4E0A;&#x53F8;&#x9891;&#x7E41;&#x53D1;&#x9001;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x90AE;&#x4EF6;&#x3002;<br>&#x70B9;&#x51FB;&#x201C;&#x56DE;&#x590D;&#x5168;&#x90E8;&#x201D;&#x524D;&#xFF0C;&#x8981;&#x4E09;&#x601D;&#x800C;&#x884C;!</li>
<li>&#x4E3B;&#x52A8;&#x63A7;&#x5236;&#x90AE;&#x4EF6;&#x7684;&#x6765;&#x5F80;<br>&#x4E3A;&#x907F;&#x514D;&#x65E0;&#x8C13;&#x7684;&#x56DE;&#x590D;&#xFF0C;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x5728;&#x6587;&#x4E2D;&#x6307;&#x5B9A;&#x90E8;&#x5206;&#x6536;&#x4EF6;&#x4EBA;&#x7ED9;&#x51FA;&#x56DE;&#x590D;&#xFF0C;&#x6216;&#x5728;&#x6587;&#x672B;&#x6DFB;&#x4E0A;&#x4EE5;&#x4E0B;&#x8BED;&#x53E5;&#xFF1A;&#x201C;&#x5168;&#x90E8;&#x529E;&#x59A5;&#x201D;&#x3001;&#x201C;&#x65E0;&#x9700;&#x884C;&#x52A8;&#x201D;&#x3001;&#x201C;&#x4EC5;&#x4F9B;&#x53C2;&#x8003;&#xFF0C;&#x65E0;&#x9700;&#x56DE;&#x590D;&#x201D;&#x3002;</li>
</ol>
</blockquote>
<h2 id="&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x53D1;&#x9001;&#x6284;&#x9001;&#x5BC6;&#x9001;"><a href="#&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x53D1;&#x9001;&#xFF0C;&#x6284;&#x9001;&#xFF0C;&#x5BC6;&#x9001;" class="headerlink" title="&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x53D1;&#x9001;&#xFF0C;&#x6284;&#x9001;&#xFF0C;&#x5BC6;&#x9001;"></a>&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x53D1;&#x9001;&#xFF0C;&#x6284;&#x9001;&#xFF0C;&#x5BC6;&#x9001;</h2><blockquote>
<p>&#x8981;&#x533A;&#x5206;To&#x548C;CC&#x8FD8;&#x6709;BCC(&#x533A;&#x5206;&#x6536;&#x4EF6;&#x4EBA;&#x3001;&#x6284;&#x9001;&#x4EBA;&#x3001;&#x79D8;&#x9001;&#x4EBA;)</p>
<ol>
<li>To&#x7684;&#x4EBA;&#x662F;&#x8981;&#x53D7;&#x7406;&#x8FD9;&#x5C01;&#x90AE;&#x4EF6;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x7406;&#x5E94;&#x5BF9;&#x90AE;&#x4EF6;&#x4E88;&#x4EE5;&#x56DE;&#x590D;&#x54CD;&#x5E94;&#x3002;</li>
<li>&#x800C;CC&#x7684;&#x4EBA;&#x5219;&#x53EA;&#x662F;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x56DE;&#x4E8B;&#xFF0C;CC&#x7684;&#x4EBA;&#x6CA1;&#x6709;&#x4E49;&#x52A1;&#x5BF9;&#x90AE;&#x4EF6;&#x4E88;&#x4EE5;&#x54CD;&#x5E94;&#xFF0C;&#x5F53;&#x7136;&#x5982;&#x679C;CC&#x7684;&#x4EBA;&#x6709;&#x5EFA;&#x8BAE;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x56DE;Email.</li>
<li>&#x800C;BCC&#x662F;&#x79D8;&#x9001;&#xFF0C;&#x5373;&#x6536;&#x4FE1;&#x4EBA;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x53D1;&#x7ED9;&#x4E86;BCC&#x7684;&#x4EBA;&#x4E86;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x7528;&#x5728;&#x975E;&#x5E38;&#x89C4;&#x573A;&#x5408;&#x3002;</li>
<li>TO&#xFF0C;CC&#x4E2D;&#x7684;&#x5404;&#x6536;&#x4EF6;&#x4EBA;&#x7684;&#x6392;&#x5217;&#x5E94;&#x9075;&#x5FAA;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x3002;&#x6BD4;&#x5982;&#x6309;&#x90E8;&#x95E8;&#x6392;&#x5217;;&#x6309;&#x804C;&#x4F4D;&#x7B49;&#x7EA7;&#x4ECE;&#x9AD8;&#x5230;&#x4F4E;&#x6216;&#x4ECE;&#x4F4E;&#x5230;&#x9AD8;&#x90FD;&#x53EF;&#x4EE5;&#x3002;&#x9002;&#x5F53;&#x7684;&#x89C4;&#x5219;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x5347;&#x4F60;&#x7684;&#x5F62;&#x8C61;!</li>
<li>&#x53EA;&#x7ED9;&#x9700;&#x8981;&#x4FE1;&#x606F;&#x7684;&#x4EBA;&#x53D1;&#x9001;&#x90AE;&#x4EF6;&#xFF0C;&#x4E0D;&#x8981;&#x5360;&#x7528;&#x4ED6;&#x4EBA;&#x7684;&#x8D44;&#x6E90;</li>
<li>&#x8F6C;&#x53D1;&#x90AE;&#x4EF6;&#x8981;&#x7A81;&#x51FA;&#x4FE1;&#x606F;<br>&#x5728;&#x4F60;&#x8F6C;&#x53D1;&#x6D88;&#x606F;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x6536;&#x4EF6;&#x4EBA;&#x9700;&#x8981;&#x6B64;&#x6D88;&#x606F;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8F6C;&#x53D1;&#x654F;&#x611F;&#x6216;&#x8005;&#x673A;&#x5BC6;&#x4FE1;&#x606F;&#x8981;&#x5C0F;&#x5FC3;&#x8C28;&#x614E;&#xFF0C;&#x4E0D;&#x8981;&#x628A;&#x5185;&#x90E8;&#x6D88;&#x606F;&#x8F6C;&#x53D1;&#x7ED9;&#x5916;&#x90E8;&#x4EBA;&#x5458;&#x6216;&#x8005;&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7684;&#x63A5;&#x6536;&#x4EBA;&#x3002;<br>&#x5982;&#x679C;&#x6709;&#x9700;&#x8981;&#x8FD8;&#x5E94;&#x5BF9;&#x8F6C;&#x53D1;&#x90AE;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x548C;&#x6574;&#x7406;&#xFF0C;&#x4EE5;&#x7A81;&#x51FA;&#x4FE1;&#x606F;&#x3002;&#x4E0D;&#x8981;&#x5C06;RE&#x4E86;&#x51E0;&#x5341;&#x5C42;&#x7684;&#x90AE;&#x4EF6;&#x53D1;&#x7ED9;&#x4ED6;&#x4EBA;&#xFF0C;&#x8BA9;&#x4EBA;&#x6478;&#x4E0D;&#x7740;&#x5934;&#x8111;&#x3002;</li>
</ol>
</blockquote>
<p><strong>&#x5F52;&#x7ED3;&#x5230;&#x5E95;&#xFF0C;&#x4E24;&#x53E5;&#x8BDD;&#xFF1A;&#x53EA;&#x53D1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x8BA4;&#x771F;&#x53D1;&#x90AE;&#x4EF6;!</strong></p>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/常识/">常识</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/Email/">Email</a>
  </div>

<!-- Baidu Button BEGIN -->
<div id="bdshare" class="bdshare_t bds_tools_32 get-codes-bdshare">
<a class="bds_qzone"></a>
<a class="bds_tsina"></a>
<a class="bds_tqq"></a>
<a class="bds_renren"></a>
<a class="bds_t163"></a>
<span class="bds_more"></span>
<a class="shareCount"></a>
</div>
<script type="text/javascript" id="bdshare_js" data="type=tools&amp;uid=3326447" ></script>
<script type="text/javascript" id="bdshell_js"></script>
<script type="text/javascript">
document.getElementById("bdshell_js").src = "http://bdimg.share.baidu.com/static/js/shell_v2.js?cdnversion=" + Math.ceil(new Date()/3600000)
</script>
<!-- Baidu Button END -->      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>



 <nav id="pagination" >
    
    <a href="/2016/04/06/27.java装箱、拆箱/" class="alignleft prev" >上一页</a>
    
    
    <a href="/2016/03/28/22.JavaScript基本类型/" class="alignright next" >下一页</a>
    
    <div class="clearfix"></div>
</nav>



<section id="comment">

  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="post-24.如何写邮件" data-title="如何写邮件" data-url="http://wisdombud.github.io/2016/03/30/24.如何写邮件/"></div>

  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"wisdombud"};
  	(function() {
  		var ds = document.createElement('script');
  		ds.type = 'text/javascript';ds.async = true;
  		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  		ds.charset = 'UTF-8';
  		(document.getElementsByTagName('head')[0]
  		 || document.getElementsByTagName('body')[0]).appendChild(ds);
  	})();
  	</script>
  <!-- 多说公共JS代码 end -->


</section>


</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:wisdombud.github.io">
  </form>
</div>

  <div class="widget tag">
<h3 class="title">简介</h3>
<ul class="entry">
<li>慧萌信安</li>
<li>Mis And 互联网</li>
<li></li>
<li>Theme: <a href="https://github.com/zippera/lightum">Lightum</a>
</ul>
</div>


  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/J2EE-web/">J2EE-web</a><small>3</small></li>
  
    <li><a href="/categories/SCM/">SCM</a><small>0</small></li>
  
    <li><a href="/categories/WEB/">WEB</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>7</small></li>
  
    <li><a href="/categories/javacript/">javacript</a><small>4</small></li>
  
    <li><a href="/categories/javascript/">javascript</a><small>1</small></li>
  
    <li><a href="/categories/log/">log</a><small>1</small></li>
  
    <li><a href="/categories/scm/">scm</a><small>1</small></li>
  
    <li><a href="/categories/web/">web</a><small>2</small></li>
  
    <li><a href="/categories/基础知识/">基础知识</a><small>1</small></li>
  
    <li><a href="/categories/学习/">学习</a><small>1</small></li>
  
    <li><a href="/categories/工具/">工具</a><small>1</small></li>
  
    <li><a href="/categories/常识/">常识</a><small>8</small></li>
  
    <li><a href="/categories/开发工具/">开发工具</a><small>2</small></li>
  
    <li><a href="/categories/数据库/">数据库</a><small>2</small></li>
  
  </ul>
</div>


  
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
        <embed tplayername="SWF" splayername="SWF"
            type="application/x-shockwave-flash" src="/tagcloud.swf"
            mediawrapchecked="true" pluginspage="http://www.macromedia.com/go/getflashplayer"
            id="tagcloudflash" name="tagcloudflash" bgcolor="#f3f3f3"
            quality="high" wmode="transparent" allowscriptaccess="always"
            flashvars="tcolor=0xbd1016&amp;tcolor2=0x808080&amp;hicolor=0x0065ff&amp;tspeed=100&amp;distr=true"
            height="100%" width="100%">
        </embed>
    </div>
  </div>


</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><section>
本博客由<a href="https://github.com/RoonyLi">李钊</a>维护，欢迎<a href="mailto:lizhao@wisdombud.com">投稿</a>
</section>
<div class="clearfix"></div>
</footer>
  <script src="//libs.baidu.com/jquery/2.0.3/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>



<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<!-- mathjax config similar to math.stackexchange -->

<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [ ['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for(i=0; i < all.length; i += 1) {
            all[i].SourceElement().parentNode.className += ' has-jax';
        }
    });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
</body>
</html>


<a href="https://github.com/wisdombud" target="_blank"><img style="position: absolute; top: 0; left: 0; border: 0;" src="/imgs/forkme_left_green_007200.png" alt="Fork me on GitHub"></a>
