

<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>验证码发展史 | 技术博客</title>
  <meta name="author" content="Joseph">
  
  <meta name="description" content="部门的技术博客">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="验证码发展史"/>
  <meta property="og:site_name" content="技术博客"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon" type="image/x-ico">
  <link rel="alternate" href="http://wisdombud.github.io/atom.xml" title="技术博客" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//libs.baidu.com/jquery/1.8.0/jquery.min.js"></script>
</head>


<body>
  <header id="header" class="inner">
<div class="alignleft">
  <h1><a href="/">技术博客</a></h1>
  <h2><a href="/">慧萌信安互联网</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">归档</a></li>
    
	<li> <a href="/atom.xml">RSS</a> </li>
<li> <a title="把这个链接拖到你的Chrome收藏夹工具栏中" href='javascript:(function() {
	function c() {
		var e = document.createElement("link");
		e.setAttribute("type", "text/css");
		e.setAttribute("rel", "stylesheet");
		e.setAttribute("href", f);
		e.setAttribute("class", l);
		document.body.appendChild(e)
	}
 
	function h() {
		var e = document.getElementsByClassName(l);
		for (var t = 0; t < e.length; t++) {
			document.body.removeChild(e[t])
		}
	}
 
	function p() {
		var e = document.createElement("div");
		e.setAttribute("class", a);
		document.body.appendChild(e);
		setTimeout(function() {
			document.body.removeChild(e)
		}, 100)
	}
 
	function d(e) {
		return {
			height : e.offsetHeight,
			width : e.offsetWidth
		}
	}
 
	function v(i) {
		var s = d(i);
		return s.height > e && s.height < n && s.width > t && s.width < r
	}
 
	function m(e) {
		var t = e;
		var n = 0;
		while (!!t) {
			n += t.offsetTop;
			t = t.offsetParent
		}
		return n
	}
 
	function g() {
		var e = document.documentElement;
		if (!!window.innerWidth) {
			return window.innerHeight
		} else if (e && !isNaN(e.clientHeight)) {
			return e.clientHeight
		}
		return 0
	}
 
	function y() {
		if (window.pageYOffset) {
			return window.pageYOffset
		}
		return Math.max(document.documentElement.scrollTop, document.body.scrollTop)
	}
 
	function E(e) {
		var t = m(e);
		return t >= w && t <= b + w
	}
 
	function S() {
		var e = document.createElement("audio");
		e.setAttribute("class", l);
		e.src = i;
		e.loop = false;
		e.addEventListener("canplay", function() {
			setTimeout(function() {
				x(k)
			}, 500);
			setTimeout(function() {
				N();
				p();
				for (var e = 0; e < O.length; e++) {
					T(O[e])
				}
			}, 15500)
		}, true);
		e.addEventListener("ended", function() {
			N();
			h()
		}, true);
		e.innerHTML = " <p>If you are reading this, it is because your browser does not support the audio element. We recommend that you get a new browser.</p> <p>";
		document.body.appendChild(e);
		e.play()
	}
 
	function x(e) {
		e.className += " " + s + " " + o
	}
 
	function T(e) {
		e.className += " " + s + " " + u[Math.floor(Math.random() * u.length)]
	}
 
	function N() {
		var e = document.getElementsByClassName(s);
		var t = new RegExp("\\b" + s + "\\b");
		for (var n = 0; n < e.length; ) {
			e[n].className = e[n].className.replace(t, "")
		}
	}
 
	var e = 30;
	var t = 30;
	var n = 350;
	var r = 350;
	var i = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake.mp3";
	var s = "mw-harlem_shake_me";
	var o = "im_first";
	var u = ["im_drunk", "im_baked", "im_trippin", "im_blown"];
	var a = "mw-strobe_light";
	var f = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake-style.css";
	var l = "mw_added_css";
	var b = g();
	var w = y();
	var C = document.getElementsByTagName("*");
	var k = null;
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			if (E(A)) {
				k = A;
				break
			}
		}
	}
	if (A === null) {
		console.warn("Could not find a node of the right size. Please try a different page.");
		return
	}
	c();
	S();
	var O = [];
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			O.push(A)
		}
	}
})()    '>High一下</a> </li>

  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div></header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <div class="post-content">
    <header>
      
  
    <h1 class="title">验证码发展史</h1>
  

      
        <div class="icon"></div>
        <p style="font-family: Helvetica Neue, Helvetica, Arial, "Hiragino Sans GB", sans-serif;">
           <span style=" display: block;  margin: 10px 0; ">
 	时间：<time style="display:inline" datetime="2016-05-06T01:53:02.000Z">2016-05-06</time></span>
        
          <span style=" display: block;  margin: 10px 0; ">作者：刘泽霖</span>
        
      

    </header>
    <div class="entry">
      
        <h2 id="&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x8BDE;&#x751F;"><a href="#&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x8BDE;&#x751F;" class="headerlink" title="&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x8BDE;&#x751F;"></a>&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x8BDE;&#x751F;</h2><blockquote>
<p>&#x9996;&#x5148;&#xFF0C;&#x5148;&#x79D1;&#x666E;&#x4E0B;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x5B98;&#x65B9;&#x89E3;&#x91CA;&#xFF1A;&#x9A8C;&#x8BC1;&#x7801;&#xFF08;CAPTCHA&#xFF09;&#x662F;&#x201C;Completely Automated Public Turing test to tell Computers andHumans Apart&#x201D;&#xFF08;&#x5168;&#x81EA;&#x52A8;&#x533A;&#x5206;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x4EBA;&#x7C7B;&#x7684;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#xFF09;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x533A;&#x5206;&#x7528;&#x6237;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x8FD8;&#x662F;&#x4EBA;&#x7684;&#x516C;&#x5171;&#x5168;&#x81EA;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;<br>&#x7F51;&#x9F84;&#x8F83;&#x4E45;&#x7684;&#x7F51;&#x53CB;&#x5927;&#x6982;&#x90FD;&#x8BB0;&#x5F97;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x4E0A;&#x7F51;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x9A8C;&#x8BC1;&#x7801;&#x8FD9;&#x4E48;&#x4E00;&#x79CD;&#x4E1C;&#x897F;&#x7684;&#x3002;&#x8FD9;&#x9020;&#x6210;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x6076;&#x610F;&#x6CE8;&#x518C;&#xFF0C;&#x5783;&#x573E;&#x8BC4;&#x8BBA;&#xFF0C;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x8F70;&#x70B8;&#x4EBA;&#x6C11;&#x7FA4;&#x4F17;&#x7684;&#x773C;&#x7403;,&#x6DFB;&#x52A0;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D1F;&#x62C5;&#x3002;<br>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x6076;&#x610F;&#x6CE8;&#x518C;&#x3001;&#x7834;&#x89E3;&#x5BC6;&#x7801;&#x3001;&#x5237;&#x7968;&#x3001;&#x8BBA;&#x575B;&#x704C;&#x6C34;&#x2026;<br>&#x6700;&#x5148;&#x60F3;&#x8981;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x662F;&#x96C5;&#x864E;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x65E9;&#x671F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x514D;&#x8D39;&#x90AE;&#x4EF6;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E00;&#x65B9;&#x9762;&#x8981;&#x89E3;&#x51B3;&#x7528;&#x6237;&#x4EEC;&#x6BCF;&#x5929;&#x9047;&#x5230;&#x7684;&#x6570;&#x4EE5;&#x767E;&#x8BA1;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8F70;&#x70B8;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4ED6;&#x4EEC; &#x81EA;&#x5DF1;&#x7684;&#x514D;&#x8D39;&#x90AE;&#x7BB1;&#xFF0C;&#x6070;&#x6070;&#x53C8;&#x662F;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x6700;&#x7231;&#xFF0C;&#x8017;&#x8D39;&#x65E0;&#x6570;&#x8D44;&#x6E90;&#x6240;&#x963B;&#x6B62;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x90FD;&#x6765;&#x81EA;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x8BA9;&#x96C5;&#x864E;&#x5F00;&#x59CB;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x4EBA;&#x673A;&#x8FA8;&#x8BC6;&#x95EE;&#x9898;&#x3002;<br>&#x4ED6;&#x4EEC;&#x627E;&#x5230;&#x4E00;&#x4F4D;&#x5F53;&#x65F6;&#x521A;&#x521A;21&#x5C81;&#x7684;&#x5361;&#x5185;&#x57FA;&#x6885;&#x9686;&#x5927;&#x5B66;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5929;&#x624D;&#x8DEF;&#x6613;&#x65AF;&#x3002;&#x800C;&#x8DEF;&#x6613;&#x65AF;&#x7ED9;&#x51FA;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x8BA9;&#x4EBA;&#x6C11;&#x7FA4;&#x4F17;&#x5FAE;&#x5FAE;&#x76B1;&#x7709;&#xFF0C;&#x4F46;&#x662F;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x8038;&#x80A9;&#x6320;&#x5934;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#xFF08;&#x82F1;&#x6587;&#x540D;CAPTCHA&#xFF0C;&#x5168;&#x81EA;&#x52A8;&#x533A;&#x5206;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x4EBA;&#x7C7B;&#x7684;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#x7684;&#x7F29;&#x5199;&#xFF09;&#x3002;<br><img src="http://7xtgso.com2.z0.glb.clouddn.com/%E5%9B%BE%E7%89%871.png" alt="&#x8DEF;&#x6613;&#x65AF;&#xB7;&#x8303;&#xB7;&#x5B89;"><br><strong>&#x9A8C;&#x8BC1;&#x7801;&#x4E4B;&#x7236;:&#x8DEF;&#x6613;&#x65AF;&#xB7;&#x8303;&#xB7;&#x5B89;</strong></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x800C;&#x5DE7;&#x5999;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5148;&#x662F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x7A0B;&#x5E8F;&#x628A;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x7684;&#x6C61;&#x67D3;&#xFF0C;&#x626D;&#x66F2;&#xFF0C;&#x518D;&#x663E;&#x793A;&#x7ED9;&#x7535;&#x8111;&#x524D;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x53EA;&#x6709;&#x4EBA;&#x773C;&#x624D;&#x80FD;&#x591F;&#x8FA8;&#x8BC6;&#x8FD9;&#x4E9B;&#x88AB;&#x968F;&#x673A;&#x6C61;&#x67D3;&#x7684;&#x626D;&#x66F2;&#x5B57;&#x7B26;&#x3002;<br>&#x8FD9;&#x79CD;&#x8BA9;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x626D;&#x66F2;&#x53D8;&#x5F62;&#x7684;&#x56FE;&#x7247;&#x6240;&#x663E;&#x793A;&#x7684;&#x6570;&#x5B57;&#x6216;&#x5B57;&#x6BCD;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4FBF;&#x662F;&#x6700;&#x539F;&#x59CB;&#x7684;&#x4E00;&#x79CD;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x4E5F;&#x5F00;&#x59CB;&#x7ED9;&#x5404;&#x5927;&#x7F51;&#x7AD9;&#x7528;&#x6765;&#x767B;&#x5F55;&#x548C;&#x7533;&#x8BF7;&#x8D26;&#x53F7;&#x4F7F;&#x7528;&#xFF0C;&#x8FD8;&#x6709;&#x7528;&#x6765;&#x56DE;&#x590D;&#x8BBA;&#x575B;&#x5E16;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x89C4;&#x907F;&#x591A;&#x6B21;&#x767B;&#x5F55;&#x5931;&#x8D25;&#x548C;&#x6279;&#x91CF;&#x7533;&#x8BF7;&#x8D26;&#x53F7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x548C;&#x9632;&#x6B62;&#x8BBA;&#x575B;&#x704C;&#x6C34;&#x7B49;&#x95EE;&#x9898;&#x3002;<br>&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x6E17;&#x900F;&#x5230;&#x4EBA;&#x4EEC;&#x6570;&#x5B57;&#x5316;&#x751F;&#x6D3B;&#x7684;&#x5404;&#x4E2A;&#x89D2;&#x843D;&#x3002;&#x867D;&#x7136;&#x662F;&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x4F46;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x8BDF;&#x75C5;&#x8FD9;&#x4E00;&#x53CD;&#x4EBA;&#x7C7B;&#x7684;&#x8BBE;&#x8BA1;&#x53D1;&#x660E;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x82B1;&#x90E8;&#x5206;&#x65F6;&#x95F4; &#x6D6A;&#x8D39;&#x5728;&#x65E0;&#x8DA3;&#x7684;&#x8BC6;&#x522B;&#x6570;&#x5B57;&#x4E0A;&#xFF0C;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x4E00;&#x4E9B;&#x7F51;&#x7AD9;&#x7684;&#x4EA4;&#x4E92;&#x4F53;&#x9A8C;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x968F;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x81EA;&#x52A8;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x6570;&#x5B57;&#x56FE;&#x5F62;&#x4E5F;&#x4E0D;&#x518D;&#x5B89;&#x5168;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x9ED1;&#x5BA2;&#x653B;&#x7834;&#x3002;&#x56E0; &#x6B64;&#xFF0C;&#x8FD9;&#x51E0;&#x5E74;&#x9488;&#x5BF9;&#x5404;&#x7C7B;&#x573A;&#x666F;&#x6539;&#x8FDB;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x3002;</p>
</blockquote>
<h3 id="1&#x95EE;&#x7B54;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;"><a href="#&#xFF08;1&#xFF09;&#x95EE;&#x7B54;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;" class="headerlink" title="&#xFF08;1&#xFF09;&#x95EE;&#x7B54;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;"></a>&#xFF08;1&#xFF09;&#x95EE;&#x7B54;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;</h3><blockquote>
<p>&#x5728;CAPTCHA&#x9A8C;&#x8BC1;&#x4E2D;&#xFF0C;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4F1A;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7531;&#x7528;&#x6237;&#x6765;&#x89E3;&#x7B54;&#x3002;&#x201D;&#xFF0C;&#x8FD9;&#x662F;&#x65E9;&#x671F;&#x7684;&#x4E00;&#x95EE;&#x4E00;&#x7B54;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x95EE;&#x7B54;&#x9A8C;&#x8BC1;&#x3002;<br><img src="http://7xtgso.com2.z0.glb.clouddn.com/%E5%9B%BE%E7%89%872.png" alt="&#x9A8C;&#x8BC1;&#x7801;1"></p>
</blockquote>
<h3 id="2&#x884C;&#x4E3A;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;"><a href="#&#xFF08;2&#xFF09;&#x884C;&#x4E3A;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;" class="headerlink" title="&#xFF08;2&#xFF09;&#x884C;&#x4E3A;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;"></a>&#xFF08;2&#xFF09;&#x884C;&#x4E3A;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;</h3><blockquote>
<p>&#x884C;&#x4E3A;&#x5F0F;&#x9A8C;&#x8BC1;&#x7801;&#x5E94;&#x8BE5;&#x7B97;&#x662F;&#x76EE;&#x524D;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x7684;&#x4E00;&#x79CD;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x4ECE;&#x5B57;&#x9762;&#x6765;&#x7406;&#x89E3;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#x884C;&#x4E3A;&#x6765;&#x5B8C;&#x6210;&#x9A8C;&#x8BC1;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x53BB;&#x8BFB;&#x61C2;&#x626D;&#x66F2;&#x7684;&#x56FE;&#x7247;&#x6587;&#x5B57;&#x3002;<br><img src="http://7xtgso.com2.z0.glb.clouddn.com/%E5%9B%BE%E7%89%873.png" alt="&#x9A8C;&#x8BC1;&#x7801;2"><br><img src="http://7xtgso.com2.z0.glb.clouddn.com/%E5%9B%BE%E7%89%874.png" alt="&#x9A8C;&#x8BC1;&#x7801;3"></p>
</blockquote>
<p>###&#xFF08;3&#xFF09;&#x624B;&#x673A;&#x9A8C;&#x8BC1;&#x7801;</p>
<blockquote>
<p>&#x968F;&#x7740;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x901A;&#x8FC7;&#x624B;&#x673A;&#x63A5;&#x6536;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x8D8A;&#x6765;&#x8D8A;&#x5E38;&#x89C1;&#x3002;&#x624B;&#x673A;&#x9A8C;&#x8BC1;&#x7801;&#x901A;&#x5E38;&#x662F;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x9A8C;&#x8BC1;&#x7801;&#x77ED;&#x4FE1;&#x5230;&#x624B;&#x673A;&#xFF0C;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x5C24;&#x5176;&#x662F;&#x8D2D;&#x7269;&#x7F51;&#x7AD9;&#xFF0C;&#x90FD;&#x63D0;&#x4F9B;&#x6709;&#x624B;&#x673A;&#x77ED;&#x4FE1;&#x9A8C; &#x8BC1;&#x7801;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x51C6;&#x786E;&#x548C;&#x5B89;&#x5168;&#x5730;&#x4FDD;&#x8BC1;&#x8D2D;&#x7269;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x7CFB;&#x7EDF;&#x3002;&#x67D0;&#x4E9B;&#x9A8C;&#x8BC1;&#x7801;&#x63A5;&#x5165;&#x5546;&#x63D0;&#x4F9B;&#x624B;&#x673A;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x7801;&#x670D;&#x52A1;&#xFF0C;&#x5404;&#x7F51;&#x7AD9;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x53D1; &#x9001;&#x8BF7;&#x6C42;&#x5230;&#x63A5;&#x5165;&#x5546;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x968F;&#x673A;&#x6570;&#x5B57;&#x6216;&#x5B57;&#x6BCD;&#x5230;&#x624B;&#x673A;&#x4E2D;&#xFF0C;&#x7531;&#x63A5;&#x5165;&#x5546;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7EDF;&#x4E00;&#x505A;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x9A8C;&#x8BC1;&#x3002;<br><img src="http://7xtgso.com2.z0.glb.clouddn.com/%E5%9B%BE%E7%89%875.png" alt="&#x624B;&#x673A;&#x9A8C;&#x8BC1;&#x7801;"><br><strong>&#x624B;&#x673A;&#x9A8C;&#x8BC1;&#x7801;</strong><br>&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x5076;&#x5C14;&#x4E5F;&#x4F1A;&#x78B0;&#x5230;&#x6536;&#x4E0D;&#x5230;&#x77ED;&#x4FE1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x7F51;&#x7AD9;&#x7684;&#x6F5C;&#x5728;&#x7528;&#x6237;&#x6D41;&#x5931;&#x3002;&#x4E8E;&#x662F;&#x4FBF;&#x6709;&#x4E86;&#x5347;&#x7EA7;&#x7248;&#x7684;&#x624B;&#x673A;&#x8BED;&#x97F3;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x53EA;&#x8981;&#x7528;&#x6237;&#x7684;&#x624B;&#x673A;&#x6216;&#x5EA7;&#x673A;&#x80FD;&#x6B63;&#x5E38;&#x63A5;&#x542C;&#x7535; &#x8BDD;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x80FD;&#x6536;&#x5230;&#x8BED;&#x97F3;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x8BED;&#x97F3;&#x64AD;&#x62A5;&#xFF08;&#x5927;&#x5BB6;&#x5982;&#x679C;&#x6709;&#x6CE8;&#x518C;&#x300A;&#x997F;&#x4E86;&#x4E48;&#x300B;&#x5C31;&#x77E5;&#x9053;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x77ED;&#x4FE1;&#x4E5F;&#x80FD;&#x540C;&#x65F6;&#x53D1;&#x9001;&#x5230;&#x7528;&#x6237;&#x624B;&#x673A;&#xFF0C;&#x5B9E;&#x73B0;&#x53CC;&#x4FDD;&#x9669;&#x786E;&#x4FDD;&#x4E07;&#x65E0;&#x4E00;&#x5931;&#x3002;&#x8BED; &#x97F3;&#x9A8C;&#x8BC1;&#x7801;&#x5982;&#x679C;&#x6709;&#x62E8;&#x901A;&#x5931;&#x8D25;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x8FD8;&#x80FD;&#x81EA;&#x52A8;&#x91CD;&#x64AD;&#xFF0C;&#x786E;&#x4FDD;&#x4E0D;&#x6F0F;&#x6389;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#xFF0C;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x89E3;&#x51B3;&#x60A8;&#x7684;&#x7F51;&#x7AD9;&#x7528;&#x6237;&#x6536;&#x4E0D;&#x5230;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>###&#xFF08;4&#xFF09;&#x5176;&#x4ED6;<br>&#x9664;&#x4E86;&#x4EE5;&#x4E0A;&#x8FD9;&#x51E0;&#x79CD;&#xFF0C;&#x8FD8;&#x5B58;&#x7740;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x65B9;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#x94F6;&#x884C;&#x7F51;&#x94F6;&#x63D0;&#x4F9B;&#x7684;&#x7535;&#x5B50;&#x53E3;&#x4EE4;&#x5361;&#x3001;&#x6E38;&#x620F;&#x63D0;&#x4F9B;&#x7684;&#x7535;&#x5B50;&#x5BC6;&#x4FDD;&#x7B49;&#x3002;&#x8FD9;&#x7C7B;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x4F5C;&#x7528;&#x5728;&#x4E8E;&#x5373;&#x4F7F;&#x7528;&#x6237;&#x4E0D;&#x614E;&#x5916;&#x6CC4;&#x6216;&#x88AB;&#x76D7;&#x4E86; &#x767B;&#x5F55;&#x5361;&#x53F7;&#x548C;&#x767B;&#x5F55;&#x5BC6;&#x7801;&#xFF0C;&#x53EA;&#x8981;&#x4FDD;&#x7BA1;&#x597D;&#x624B;&#x4E2D;&#x7684;&#x53E3;&#x4EE4;&#x5361;&#xFF0C;&#x4F7F;&#x767B;&#x5F55;&#x5361;&#x53F7;&#x3001;&#x767B;&#x5F55;&#x5BC6;&#x7801;&#x3001;&#x53E3;&#x4EE4;&#x5361;&#x4E0D;&#x88AB;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x83B7;&#x53D6;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x8D26;&#x6237;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x7528;&#x6237;&#x66F4;&#x52A0;&#x5B89;&#x5168;&#x3001;&#x653E;&#x5FC3;&#x5730;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x672A;&#x6765;"><a href="#&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x672A;&#x6765;" class="headerlink" title="&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x672A;&#x6765;"></a>&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x672A;&#x6765;</h2><p>&#x4ECE;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x53D1;&#x5C55;&#x8FDB;&#x7A0B;&#x6765;&#x770B;&#xFF0C;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x51FA;&#x672A;&#x6765;&#x7684;&#x4E3B;&#x8981;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x3002;&#x9996;&#x5148; &#x662F;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x672C;&#x8D28;&#x5C5E;&#x6027;&#x2014;&#x2014;&#x5B89;&#x5168;&#x6027;&#x3002;&#x5B89;&#x5168;&#x6027;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#xFF0C;&#x7B80;&#x5355;&#x6570;&#x5B57;&#x56FE;&#x5F62;&#x9A8C;&#x8BC1;&#x5C06;&#x88AB;&#x9010;&#x6B65;&#x6DD8;&#x6C70;&#xFF0C;&#x66F4;&#x5B8C;&#x5584;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x6280;&#x672F;&#x5728;&#x672A;&#x6765;&#x9664;&#x4E86;&#x9632;&#x6B62;&#x6076;&#x610F;&#x7834;&#x89E3;&#x5BC6;&#x7801;&#x3001;&#x5237;&#x7968;&#x3001;&#x8BBA;&#x575B;&#x704C;&#x6C34;&#x3001; &#x5237;&#x9875;&#x7B49;&#x884C;&#x4E3A;&#x5916;&#xFF0C;&#x8FD8;&#x662F;&#x7528;&#x6237;&#x4E0E;&#x7F51;&#x7AD9;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7684;&#x6709;&#x529B;&#x4FDD;&#x969C;&#x3002;<br><img src="http://7xtgso.com2.z0.glb.clouddn.com/%E5%9B%BE%E7%89%876.png" alt="&#x6307;&#x7EB9;&#x8BC6;&#x522B;"><br><strong>&#x6307;&#x7EB9;&#x8BC6;&#x522B;</strong></p>
</blockquote>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/常识/">常识</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/captcha/">captcha</a>
  </div>

<!-- Baidu Button BEGIN -->
<div id="bdshare" class="bdshare_t bds_tools_32 get-codes-bdshare">
<a class="bds_qzone"></a>
<a class="bds_tsina"></a>
<a class="bds_tqq"></a>
<a class="bds_renren"></a>
<a class="bds_t163"></a>
<span class="bds_more"></span>
<a class="shareCount"></a>
</div>
<script type="text/javascript" id="bdshare_js" data="type=tools&amp;uid=3326447" ></script>
<script type="text/javascript" id="bdshell_js"></script>
<script type="text/javascript">
document.getElementById("bdshell_js").src = "http://bdimg.share.baidu.com/static/js/shell_v2.js?cdnversion=" + Math.ceil(new Date()/3600000)
</script>
<!-- Baidu Button END -->      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>



 <nav id="pagination" >
    
    <a href="/2016/05/17/33.JRebel简介/" class="alignleft prev" >上一页</a>
    
    
    <a href="/2016/05/06/31.通过IP地址获取用户所在地/" class="alignright next" >下一页</a>
    
    <div class="clearfix"></div>
</nav>



<section id="comment">

  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="post-32.验证码发展史" data-title="验证码发展史" data-url="http://wisdombud.github.io/2016/05/06/32.验证码发展史/"></div>

  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"wisdombud"};
  	(function() {
  		var ds = document.createElement('script');
  		ds.type = 'text/javascript';ds.async = true;
  		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  		ds.charset = 'UTF-8';
  		(document.getElementsByTagName('head')[0]
  		 || document.getElementsByTagName('body')[0]).appendChild(ds);
  	})();
  	</script>
  <!-- 多说公共JS代码 end -->


</section>


</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:wisdombud.github.io">
  </form>
</div>

  <div class="widget tag">
<h3 class="title">简介</h3>
<ul class="entry">
<li>慧萌信安</li>
<li>Mis And 互联网</li>
<li></li>
<li>Theme: <a href="https://github.com/zippera/lightum">Lightum</a>
</ul>
</div>


  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/J2EE-web/">J2EE-web</a><small>3</small></li>
  
    <li><a href="/categories/SCM/">SCM</a><small>0</small></li>
  
    <li><a href="/categories/WEB/">WEB</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>7</small></li>
  
    <li><a href="/categories/javacript/">javacript</a><small>4</small></li>
  
    <li><a href="/categories/javascript/">javascript</a><small>1</small></li>
  
    <li><a href="/categories/log/">log</a><small>1</small></li>
  
    <li><a href="/categories/scm/">scm</a><small>1</small></li>
  
    <li><a href="/categories/web/">web</a><small>2</small></li>
  
    <li><a href="/categories/基础知识/">基础知识</a><small>1</small></li>
  
    <li><a href="/categories/学习/">学习</a><small>1</small></li>
  
    <li><a href="/categories/工具/">工具</a><small>1</small></li>
  
    <li><a href="/categories/常识/">常识</a><small>8</small></li>
  
    <li><a href="/categories/开发工具/">开发工具</a><small>2</small></li>
  
    <li><a href="/categories/数据库/">数据库</a><small>2</small></li>
  
  </ul>
</div>


  
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
        <embed tplayername="SWF" splayername="SWF"
            type="application/x-shockwave-flash" src="/tagcloud.swf"
            mediawrapchecked="true" pluginspage="http://www.macromedia.com/go/getflashplayer"
            id="tagcloudflash" name="tagcloudflash" bgcolor="#f3f3f3"
            quality="high" wmode="transparent" allowscriptaccess="always"
            flashvars="tcolor=0xbd1016&amp;tcolor2=0x808080&amp;hicolor=0x0065ff&amp;tspeed=100&amp;distr=true"
            height="100%" width="100%">
        </embed>
    </div>
  </div>


</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><section>
本博客由<a href="https://github.com/RoonyLi">李钊</a>维护，欢迎<a href="mailto:lizhao@wisdombud.com">投稿</a>
</section>
<div class="clearfix"></div>
</footer>
  <script src="//libs.baidu.com/jquery/2.0.3/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>



<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<!-- mathjax config similar to math.stackexchange -->

<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [ ['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for(i=0; i < all.length; i += 1) {
            all[i].SourceElement().parentNode.className += ' has-jax';
        }
    });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
</body>
</html>


<a href="https://github.com/wisdombud" target="_blank"><img style="position: absolute; top: 0; left: 0; border: 0;" src="/imgs/forkme_left_green_007200.png" alt="Fork me on GitHub"></a>
