

<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>日志简介 | 技术博客</title>
  <meta name="author" content="Joseph">
  
  <meta name="description" content="部门的技术博客">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="日志简介"/>
  <meta property="og:site_name" content="技术博客"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon" type="image/x-ico">
  <link rel="alternate" href="http://wisdombud.github.io/atom.xml" title="技术博客" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//libs.baidu.com/jquery/1.8.0/jquery.min.js"></script>
</head>


<body>
  <header id="header" class="inner">
<div class="alignleft">
  <h1><a href="/">技术博客</a></h1>
  <h2><a href="/">慧萌信安互联网</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">归档</a></li>
    
	<li> <a href="/atom.xml">RSS</a> </li>
<li> <a title="把这个链接拖到你的Chrome收藏夹工具栏中" href='javascript:(function() {
	function c() {
		var e = document.createElement("link");
		e.setAttribute("type", "text/css");
		e.setAttribute("rel", "stylesheet");
		e.setAttribute("href", f);
		e.setAttribute("class", l);
		document.body.appendChild(e)
	}
 
	function h() {
		var e = document.getElementsByClassName(l);
		for (var t = 0; t < e.length; t++) {
			document.body.removeChild(e[t])
		}
	}
 
	function p() {
		var e = document.createElement("div");
		e.setAttribute("class", a);
		document.body.appendChild(e);
		setTimeout(function() {
			document.body.removeChild(e)
		}, 100)
	}
 
	function d(e) {
		return {
			height : e.offsetHeight,
			width : e.offsetWidth
		}
	}
 
	function v(i) {
		var s = d(i);
		return s.height > e && s.height < n && s.width > t && s.width < r
	}
 
	function m(e) {
		var t = e;
		var n = 0;
		while (!!t) {
			n += t.offsetTop;
			t = t.offsetParent
		}
		return n
	}
 
	function g() {
		var e = document.documentElement;
		if (!!window.innerWidth) {
			return window.innerHeight
		} else if (e && !isNaN(e.clientHeight)) {
			return e.clientHeight
		}
		return 0
	}
 
	function y() {
		if (window.pageYOffset) {
			return window.pageYOffset
		}
		return Math.max(document.documentElement.scrollTop, document.body.scrollTop)
	}
 
	function E(e) {
		var t = m(e);
		return t >= w && t <= b + w
	}
 
	function S() {
		var e = document.createElement("audio");
		e.setAttribute("class", l);
		e.src = i;
		e.loop = false;
		e.addEventListener("canplay", function() {
			setTimeout(function() {
				x(k)
			}, 500);
			setTimeout(function() {
				N();
				p();
				for (var e = 0; e < O.length; e++) {
					T(O[e])
				}
			}, 15500)
		}, true);
		e.addEventListener("ended", function() {
			N();
			h()
		}, true);
		e.innerHTML = " <p>If you are reading this, it is because your browser does not support the audio element. We recommend that you get a new browser.</p> <p>";
		document.body.appendChild(e);
		e.play()
	}
 
	function x(e) {
		e.className += " " + s + " " + o
	}
 
	function T(e) {
		e.className += " " + s + " " + u[Math.floor(Math.random() * u.length)]
	}
 
	function N() {
		var e = document.getElementsByClassName(s);
		var t = new RegExp("\\b" + s + "\\b");
		for (var n = 0; n < e.length; ) {
			e[n].className = e[n].className.replace(t, "")
		}
	}
 
	var e = 30;
	var t = 30;
	var n = 350;
	var r = 350;
	var i = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake.mp3";
	var s = "mw-harlem_shake_me";
	var o = "im_first";
	var u = ["im_drunk", "im_baked", "im_trippin", "im_blown"];
	var a = "mw-strobe_light";
	var f = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake-style.css";
	var l = "mw_added_css";
	var b = g();
	var w = y();
	var C = document.getElementsByTagName("*");
	var k = null;
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			if (E(A)) {
				k = A;
				break
			}
		}
	}
	if (A === null) {
		console.warn("Could not find a node of the right size. Please try a different page.");
		return
	}
	c();
	S();
	var O = [];
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			O.push(A)
		}
	}
})()    '>High一下</a> </li>

  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div></header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <div class="post-content">
    <header>
      
  
    <h1 class="title">日志简介</h1>
  

      
        <div class="icon"></div>
        <p style="font-family: Helvetica Neue, Helvetica, Arial, "Hiragino Sans GB", sans-serif;">
           <span style=" display: block;  margin: 10px 0; ">
 	时间：<time style="display:inline" datetime="2016-03-11T08:38:35.000Z">2016-03-11</time></span>
        
          <span style=" display: block;  margin: 10px 0; ">作者：joseph</span>
        
      

    </header>
    <div class="entry">
      
        <h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x65E5;&#x5FD7;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x65E5;&#x5FD7;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x65E5;&#x5FD7;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x65E5;&#x5FD7;</h2><blockquote>
<p>&#x56E0;&#x4E3A;&#x9879;&#x76EE;&#x4E0A;&#x7EBF;&#x540E;&#x4E0D;&#x5141;&#x8BB8;&#x4F60;&#x8C03;&#x8BD5;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x901A;&#x8FC7;Log&#x6765;&#x5206;&#x6790;&#x95EE;&#x9898;&#x3002;&#x9879;&#x76EE;&#x51FA;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4F60;&#x8981;&#x80FD;&#x62FF;&#x51FA;Log&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x8D1F;&#x8D23;&#x7684;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8981;&#x4ECE;Log&#x91CC;&#x5FEB;&#x901F;&#x627E;&#x51FA;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4ECE;Log&#x91CC;&#x627E;&#x51FA;&#x9519;&#x8BEF;&#x539F;&#x56E0;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x60B2;&#x50AC;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;bug&#x4E0D;&#x5BB9;&#x6613;&#x91CD;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;</p>
</blockquote>
<h2 id="&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x6253;&#x65E5;&#x5FD7;"><a href="#&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x6253;&#x65E5;&#x5FD7;" class="headerlink" title="&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x6253;&#x65E5;&#x5FD7;"></a>&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x6253;&#x65E5;&#x5FD7;</h2><blockquote>
<p>   &#x6253;log&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8FC5;&#x901F;&#x6392;&#x9519;&#x6216;&#x5728;&#x6709;&#x4E89;&#x8BAE;&#x65F6;&#x62FF;&#x51FA;&#x8BC1;&#x636E;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;log&#x4E0D;&#x5728;&#x591A;&#xFF0C;&#x53EA;&#x8981;&#x6293;&#x4F4F;&#x4E00;&#x5207;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x5229;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;
&#x3000;</p>
<h3 id="log&#x7684;&#x7EA7;&#x522B;&#x53CA;&#x5BF9;&#x5E94;&#x65E5;&#x5FD7;"><a href="#LOG&#x7684;&#x7EA7;&#x522B;&#x53CA;&#x5BF9;&#x5E94;&#x65E5;&#x5FD7;" class="headerlink" title="LOG&#x7684;&#x7EA7;&#x522B;&#x53CA;&#x5BF9;&#x5E94;&#x65E5;&#x5FD7;&#x3000;"></a>LOG&#x7684;&#x7EA7;&#x522B;&#x53CA;&#x5BF9;&#x5E94;&#x65E5;&#x5FD7;&#x3000;</h3><p>Log&#x6700;&#x5E38;&#x7528;&#x7684;&#x7EA7;&#x522B;&#x5C31;&#x662F;DEBUG&#xFF0C;INFO&#xFF0C;WARN&#xFF0C;ERROR&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5F88;&#x5C11;&#x7528;&#x3002;&#x5982;&#x4F55;&#x8FD0;&#x7528;&#x5408;&#x9002;&#x7684;Log&#x7EA7;&#x522B;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5728;&#x4E0D;&#x8BE5;&#x7528;ERROR&#x7684;&#x5730;&#x65B9;&#x7528;&#x4E86;ERROR&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x9EBB;&#x70E6;&#x3002;<br>&#x3000;1.ERROR&#xFF1A;<br>&#x3000;&#x3000;ERROR&#x662F;&#x9519;&#x8BEF;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x4F46;&#x4E0D;&#x4EE3;&#x8868;&#x51FA;&#x73B0;&#x5F02;&#x5E38;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x8BE5;&#x6253;ERROR&#x3002;&#x6211;&#x8BA4;&#x4E3A;ERROR&#x662F;&#x76F8;&#x5BF9;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x6765;&#x8BF4;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86;ERROR&#x90A3;&#x5C31;&#x4EE3;&#x8868;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x8981;&#x67E5;&#x4E00;&#x4E0B;&#x539F;&#x56E0;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x7A0B;&#x5E8F;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x73AF;&#x5883;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x8BE5;&#x51FA;&#x9519;&#x7684;&#x5730;&#x65B9;&#x51FA;&#x9519;&#x4E86;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x51FA;&#x95EE;&#x9898;&#x65F6;&#x9700;&#x8981;&#x89E3;&#x51B3;&#xFF0C;&#x5C31;&#x6253;ERROR&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x5C31;&#x4E0D;&#x8981;&#x6253;ERROR&#x3002;<br>&#x3000;&#x3000;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x3002;&#x8C03;&#x7528;&#x8005;&#x4F20;&#x8FC7;&#x6765;&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x5728;&#x4F60;&#x7684;&#x63A5;&#x53D7;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x4E0D;&#x80FD;&#x6253;ERROR&#xFF0C;&#x56E0;&#x4E3A;&#x4F20;&#x4EC0;&#x4E48;&#x503C;&#x662F;&#x7528;&#x6237;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6709;&#x76D1;&#x63A7;&#x7A0B;&#x5E8F;&#x7684;&#x8BDD;&#xFF0C;&#x68C0;&#x6D4B;&#x5230;ERROR&#x6216;WARN&#x5C31;&#x62A5;&#x8B66;&#xFF0C;&#x53C2;&#x6570;&#x9519;&#x8BEF;&#x4F60;&#x4E5F;&#x6253;ERROR&#xFF0C;&#x90A3;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x4F1A;&#x75AF;&#x6389;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x505A;&#x4E00;&#x4E2A;&#x5BF9;&#x8BB2;&#x673A;&#xFF0C;&#x5728;&#x89E3;&#x6790;&#x8BED;&#x97F3;&#x6570;&#x636E;&#x5305;&#x65F6;&#x51FA;&#x9519;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x6253;ERROR&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x662F;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x8BE5;&#x51FA;&#x9519;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8981;&#x4E0D;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x89E3;&#x6790;&#x4EE3;&#x7801;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x8981;&#x4E0D;&#x5C31;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x62FC;&#x51D1;&#x8BED;&#x97F3;&#x5305;&#x65F6;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x9700;&#x8981;&#x4F60;&#x6765;&#x627E;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x6253;ERROR&#x3002;<br>&#x3000;&#x3000;2.WARN&#xFF1A;<br>&#x3000;&#x3000;WARN&#x662F;&#x6307;&#x51FA;&#x73B0;&#x4E86;&#x4E0D;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x7684;&#x95EE;&#x9898;&#xFF0C;WARN&#x4E5F;&#x662F;&#x95EE;&#x9898;&#x4F46;&#x4E0D;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x5982;&#x679C;WARN&#x51FA;&#x73B0;&#x7684;&#x8FC7;&#x4E8E;&#x9891;&#x7E41;&#x6216;&#x6B21;&#x6570;&#x592A;&#x591A;&#xFF0C;&#x90A3;&#x5C31;&#x4EE3;&#x8868;&#x4F60;&#x8981;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x7A0B;&#x5E8F;&#x6216;&#x73AF;&#x5883;&#x6216;&#x4F9D;&#x8D56;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x771F;&#x7684;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5047;&#x5982;&#x4F60;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x8D85;&#x65F6;&#xFF0C;&#x8D85;&#x65F6;&#x4E4B;&#x540E;&#x4F1A;&#x629B;&#x5F02;&#x5E38;&#xFF0C;&#x4F60;&#x5728;try&#x5757;&#x91CC;&#x4E0D;&#x8BE5;&#x6253;ERROR&#x4E5F;&#x4E0D;&#x8BE5;&#x6253;INFO&#x6765;&#x65E0;&#x89C6;&#x5B83;&#xFF0C;&#x8FD9;&#x65F6;&#x4F60;&#x5E94;&#x8BE5;&#x6253;WARN&#xFF0C;&#x7D27;&#x7D27;&#x662F;&#x8B66;&#x544A;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x65F6;&#x8FC7;&#x591A;&#x90A3;&#x5C31;&#x8BE5;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x4E86;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5BF9;&#x65B9;&#x63A5;&#x53E3;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x6216;&#x8005;&#x662F;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;<br>&#x3000;&#x3000;3.INFO&#x548C;DEBUG&#xFF1A;<br>&#x3000;&#x3000;ERROR&#x548C;WARN&#x662F;&#x6307;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x800C;INFO&#x548C;DEBUG&#x5C31;&#x662F;&#x6307;&#x4E00;&#x822C;&#x7684;&#x4FE1;&#x606F;&#x4E86;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x51FA;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6761;log&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5206;&#x6790;&#x95EE;&#x9898;&#x6216;&#x67E5;&#x770B;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x5C31;&#x5E94;&#x8BE5;&#x6253;&#x4E2A;INFO&#x3002;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x8C03;&#x8BD5;&#x9636;&#x6BB5;&#x67E5;&#x770B;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x8FD0;&#x884C;&#x6B63;&#x786E;&#x90A3;&#x5C31;&#x8981;&#x6253;DEBUG&#x3002;&#x524D;&#x8FB9;&#x8BA8;&#x8BBA;&#x7684;&#x63A5;&#x53E3;&#x53C2;&#x6570;&#x9519;&#x8BEF;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x6253;&#x4E2A;INFO&#x4E86;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x8BF4;&#x4F60;&#x7684;&#x63A5;&#x53E3;&#x603B;&#x662F;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x662F;&#x4ED6;&#x7684;&#x54EA;&#x4E2A;&#x53C2;&#x6570;&#x4F20;&#x9519;&#x4E86;&#x3002;</p>
</blockquote>
<h3 id="&#x5E38;&#x89C1;&#x65E5;&#x5FD7;&#x70B9;"><a href="#&#x5E38;&#x89C1;&#x65E5;&#x5FD7;&#x70B9;" class="headerlink" title="&#x5E38;&#x89C1;&#x65E5;&#x5FD7;&#x70B9;"></a>&#x5E38;&#x89C1;&#x65E5;&#x5FD7;&#x70B9;</h3><blockquote>
<p>1.&#x51FD;&#x6570;&#x5F00;&#x59CB;&#x7ED3;&#x675F;&#x5904;<br>&#x3000;&#x3000;&#x5728;&#x91CD;&#x8981;&#x51FD;&#x6570;&#x7684;&#x5F00;&#x59CB;&#x7ED3;&#x675F;&#x51FA;&#x5E94;&#x8BE5;&#x6253;&#x4E0A;log &#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x770B;log&#x65F6;&#x4F1A;&#x6BD4;&#x8F83;&#x76F4;&#x89C2;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7ED3;&#x675F;&#x5C31;&#x4F1A;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x4E07;&#x4E00;&#x4E2D;&#x95F4;&#x51FA;&#x5F02;&#x5E38;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x4E86;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x662F;&#x5728;&#x54EA;&#x4E2A;&#x51FD;&#x6570;&#x7A81;&#x7136;&#x4E2D;&#x65AD;&#x7684;&#x3002;&#x4E5F;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x903B;&#x8F91;&#x5757;&#x7684;&#x5F00;&#x59CB;&#x7ED3;&#x675F;&#x3002;<br>2.&#x8FD4;&#x56DE;&#x7ED3;&#x679C;<br>&#x3000;&#x3000;&#x5C3D;&#x91CF;&#x5728;&#x91CD;&#x8981;&#x51FD;&#x6570;&#x6216;web&#x63A5;&#x53E3;&#x7684;&#x6BCF;&#x4E2A;&#x8FD4;&#x56DE;&#x5206;&#x652F;&#x6253;&#x5370;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x51FA;&#x73B0;&#x4E0D;&#x597D;&#x5206;&#x6790;&#x7684;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x4ECE;&#x7EC6;&#x8282;&#x4E0B;&#x624B;&#xFF0C;&#x8FD9;&#x65F6;log&#x4F1A;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x3002;&#x5982;&#x679C;&#x8DDF;&#x5408;&#x4F5C;&#x65B9;&#x5728;&#x6570;&#x636E;&#x65B9;&#x9762;&#x51FA;&#x73B0;&#x4E89;&#x8BAE;&#x4E5F;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x62FF;&#x51FA;&#x8BC1;&#x636E;&#x3002;<br>3.&#x6DFB;&#x52A0;Exception&#x5F02;&#x5E38;&#x7684;&#x6355;&#x83B7;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x6355;&#x83B7;&#x4E86;&#x67D0;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x90A3;&#x4F60;&#x8981;&#x5728;try&#x5757;&#x540E;&#x6DFB;&#x52A0;Exception&#x7684;&#x6355;&#x83B7;&#xFF0C;&#x4EE5;&#x9632;&#x51FA;&#x73B0;&#x8FD0;&#x884C;&#x65F6;&#x5F02;&#x5E38;&#x4E2D;&#x65AD;&#x7A0B;&#x5E8F;&#x3002;<br>4.&#x52A1;&#x5FC5;&#x6253;&#x5370;&#x5806;&#x6808;&#x4FE1;&#x606F;<br>&#x3000;&#x3000;&#x5728;&#x5F02;&#x5E38;&#x6355;&#x83B7;&#x4EE3;&#x7801;&#x4E2D;&#x52A1;&#x5FC5;&#x8981;&#x5C06;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x6253;&#x5370;&#x51FA;&#x6765;&#xFF0C;&#x5426;&#x5219;&#x6253;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x7684;log&#x53EF;&#x80FD;&#x4F1A;&#x529F;&#x4E8F;&#x4E00;&#x7BD1;&#x3002;<br>5.&#x591A;&#x7EBF;&#x7A0B;&#x7684;log<br>&#x3000;&#x3000;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;log&#x6700;&#x597D;&#x8981;&#x6807;&#x8BB0;thredId&#xFF0C;&#x5426;&#x5219;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x4F5C;&#x4E1A;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x6709;&#x6761;&#x7406;&#x7684;&#x6765;&#x89C2;&#x5BDF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;<br>6.&#x6210;&#x529F;&#x5931;&#x8D25;&#x6807;&#x5FD7;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x662F;&#x505A;&#x4E00;&#x4EF6;&#x6BD4;&#x8F83;&#x5173;&#x952E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x6210;&#x529F;&#x8FD8;&#x662F;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x8981;&#x6253;&#x5370;log&#xFF0C;&#x5426;&#x5219;&#x5173;&#x952E;&#x4E8B;&#x4EF6;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x4F55;&#x90FD;&#x62FF;&#x4E0D;&#x51FA;&#x8BC1;&#x636E;&#x7684;&#x8BDD;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x4E0D;&#x80FD;&#x8BA9;&#x4EBA;&#x4FE1;&#x670D;&#x3002;<br>7.&#x524D;&#x540E;log&#x7684;&#x5173;&#x7CFB;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x662F;web&#x7A0B;&#x5E8F;&#x6216;&#x63A5;&#x53E3;&#xFF0C;&#x90A3;log&#x5C31;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x4F60;&#x9884;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x597D;&#x51E0;&#x4E2A;&#x54CD;&#x5E94;&#x7684;log&#x7A7F;&#x63D2;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x3002;&#x4EE3;&#x7801;&#x91CC;&#x5982;&#x679C;&#x6709;&#x51E0;&#x6761;log&#x524D;&#x540E;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x8981;&#x5C06;&#x8FD9;&#x51E0;&#x6761;log&#x7684;&#x5173;&#x8054;&#x4FE1;&#x606F;&#x6253;&#x51FA;&#x6765;&#xFF0C;&#x7528;&#x6765;&#x786E;&#x5B9A;&#x662F;&#x9488;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x7684;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x6807;&#x5FD7;&#xFF0C;&#x5F88;&#x96BE;&#x8BF4;&#x540E;&#x8FB9;&#x7684;log&#x8DDF;&#x524D;&#x8FB9;&#x7684;log&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x6216;&#x8005;&#x662F;&#x9488;&#x5BF9;&#x540C;&#x4E00;&#x6761;&#x6570;&#x636E;&#x3002;<br>8.&#x5173;&#x4E8E;&#x8017;&#x65F6;<br> &#x3000;&#x3000;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x63A5;&#x53E3;&#x3001;&#x4E0A;&#x4F20;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#x7B49;&#x53EF;&#x80FD;&#x8017;&#x65F6;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x90FD;&#x8981;&#x8BB0;&#x5F55;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x6240;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5426;&#x5219;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x7F51;&#x7EDC;&#x539F;&#x56E0;&#x5462;&#xFF0C;&#x8FD8;&#x662F;&#x4F60;&#x8C03;&#x7528;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x63A5;&#x53E3;&#x6027;&#x80FD;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x8FD8;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x7A0B;&#x5E8F;&#x7684;&#x95EE;&#x9898;&#x5462;&#x3002;<br>9.&#x5173;&#x4E8E;&#x6570;&#x91CF;<br> &#x3000;&#x3000;&#x6D89;&#x53CA;&#x5230;&#x6570;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x8981;&#x6253;&#x5370;log&#xFF0C;&#x6BD4;&#x5982;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x5E93;&#x548C;&#x6279;&#x91CF;&#x62F7;&#x8D1D;&#x6587;&#x4EF6;&#x3001;&#x4E0A;&#x4F20;&#x4E0B;&#x8F7D;&#x3001;&#x6279;&#x91CF;&#x683C;&#x5F0F;&#x8F6C;&#x6362;&#x7B49;&#x6279;&#x91CF;&#x64CD;&#x4F5C;&#xFF0C;&#x8BBE;&#x8BA1;&#x5230;&#x7684;&#x6570;&#x91CF;&#x8981;&#x6253;&#x5370;&#x51FA;&#x6765;&#x3002;</p>
</blockquote>
<h3 id="&#x8BEF;&#x533A;"><a href="#&#x8BEF;&#x533A;" class="headerlink" title="&#x8BEF;&#x533A;"></a>&#x8BEF;&#x533A;</h3><blockquote>
<ol>
<li>&#x6709;&#x5F02;&#x5E38;&#x4E00;&#x5B9A;&#x6253;&#x65E5;&#x5FD7;&#x4E48;&#xFF1F;</li>
</ol>
</blockquote>
<h2 id="&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65E5;&#x5FD7;"><a href="#&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65E5;&#x5FD7;" class="headerlink" title="&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65E5;&#x5FD7;"></a>&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65E5;&#x5FD7;</h2><blockquote>
<p>&#x65F6;&#x95F4;&#x3001;&#x7C7B;&#x540D;&#x53CA;&#x51FD;&#x6570;&#x540D;&#xFF0C;&#x884C;&#x53F7;&#x3001;&#x7EBF;&#x7A0B;&#x53F7;&#x7B49;&#x7B49;</p>
<h2 id="&#x6709;&#x54EA;&#x4E9B;&#x5DF2;&#x7ECF;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x65E5;&#x5FD7;"><a href="#&#x6709;&#x54EA;&#x4E9B;&#x5DF2;&#x7ECF;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x65E5;&#x5FD7;" class="headerlink" title="&#x6709;&#x54EA;&#x4E9B;&#x5DF2;&#x7ECF;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x65E5;&#x5FD7;"></a>&#x6709;&#x54EA;&#x4E9B;&#x5DF2;&#x7ECF;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x65E5;&#x5FD7;</h2><h3 id="slf4j"><a href="#slf4j" class="headerlink" title="slf4j"></a>slf4j</h3><p><a href="http://www.cnblogs.com/f1194361820/p/5096014.html" target="_blank" rel="external">http://www.cnblogs.com/f1194361820/p/5096014.html</a></p>
<h3 id="log4j&#x914D;&#x7F6E;"><a href="#log4j&#x914D;&#x7F6E;" class="headerlink" title="log4j&#x914D;&#x7F6E;"></a>log4j&#x914D;&#x7F6E;</h3><p><a href="http://summerbell.iteye.com/blog/487736" target="_blank" rel="external">http://summerbell.iteye.com/blog/487736</a></p>
<h3 id="log4net&#x914D;&#x7F6E;"><a href="#log4net&#x914D;&#x7F6E;" class="headerlink" title="log4net&#x914D;&#x7F6E;"></a>log4net&#x914D;&#x7F6E;</h3><p><a href="http://www.cnblogs.com/jys509/p/4569874.html" target="_blank" rel="external">http://www.cnblogs.com/jys509/p/4569874.html</a><br><a href="http://www.cnblogs.com/wangsaiming/archive/2013/01/11/2856253.html" target="_blank" rel="external">http://www.cnblogs.com/wangsaiming/archive/2013/01/11/2856253.html</a></p>
</blockquote>
<h2 id="&#x5982;&#x4F55;&#x5206;&#x6790;&#x65E5;&#x5FD7;"><a href="#&#x5982;&#x4F55;&#x5206;&#x6790;&#x65E5;&#x5FD7;" class="headerlink" title="&#x5982;&#x4F55;&#x5206;&#x6790;&#x65E5;&#x5FD7;"></a>&#x5982;&#x4F55;&#x5206;&#x6790;&#x65E5;&#x5FD7;</h2><p><a href="http://www.cnblogs.com/TalkStudy/archive/2007/12/19/1005886.html" target="_blank" rel="external">http://www.cnblogs.com/TalkStudy/archive/2007/12/19/1005886.html</a></p>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/log/">log</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/log/">log</a>
  </div>

<!-- Baidu Button BEGIN -->
<div id="bdshare" class="bdshare_t bds_tools_32 get-codes-bdshare">
<a class="bds_qzone"></a>
<a class="bds_tsina"></a>
<a class="bds_tqq"></a>
<a class="bds_renren"></a>
<a class="bds_t163"></a>
<span class="bds_more"></span>
<a class="shareCount"></a>
</div>
<script type="text/javascript" id="bdshare_js" data="type=tools&amp;uid=3326447" ></script>
<script type="text/javascript" id="bdshell_js"></script>
<script type="text/javascript">
document.getElementById("bdshell_js").src = "http://bdimg.share.baidu.com/static/js/shell_v2.js?cdnversion=" + Math.ceil(new Date()/3600000)
</script>
<!-- Baidu Button END -->      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>



 <nav id="pagination" >
    
    <a href="/2016/03/15/7.java的各种O/" class="alignleft prev" >上一页</a>
    
    
    <a href="/2016/03/04/2.java web 之servlet/" class="alignright next" >下一页</a>
    
    <div class="clearfix"></div>
</nav>



<section id="comment">

  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="post-6.日志" data-title="日志简介" data-url="http://wisdombud.github.io/2016/03/11/6.日志/"></div>

  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"wisdombud"};
  	(function() {
  		var ds = document.createElement('script');
  		ds.type = 'text/javascript';ds.async = true;
  		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  		ds.charset = 'UTF-8';
  		(document.getElementsByTagName('head')[0]
  		 || document.getElementsByTagName('body')[0]).appendChild(ds);
  	})();
  	</script>
  <!-- 多说公共JS代码 end -->


</section>


</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:wisdombud.github.io">
  </form>
</div>

  <div class="widget tag">
<h3 class="title">简介</h3>
<ul class="entry">
<li>慧萌信安</li>
<li>Mis And 互联网</li>
<li></li>
<li>Theme: <a href="https://github.com/zippera/lightum">Lightum</a>
</ul>
</div>


  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/C/">C#</a><small>3</small></li>
  
    <li><a href="/categories/J2EE-web/">J2EE-web</a><small>3</small></li>
  
    <li><a href="/categories/SCM/">SCM</a><small>0</small></li>
  
    <li><a href="/categories/WEB/">WEB</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>7</small></li>
  
    <li><a href="/categories/javacript/">javacript</a><small>4</small></li>
  
    <li><a href="/categories/javascript/">javascript</a><small>1</small></li>
  
    <li><a href="/categories/log/">log</a><small>1</small></li>
  
    <li><a href="/categories/scm/">scm</a><small>1</small></li>
  
    <li><a href="/categories/web/">web</a><small>2</small></li>
  
    <li><a href="/categories/基础知识/">基础知识</a><small>1</small></li>
  
    <li><a href="/categories/学习/">学习</a><small>1</small></li>
  
    <li><a href="/categories/工具/">工具</a><small>1</small></li>
  
    <li><a href="/categories/常识/">常识</a><small>8</small></li>
  
    <li><a href="/categories/开发工具/">开发工具</a><small>2</small></li>
  
    <li><a href="/categories/数据库/">数据库</a><small>2</small></li>
  
  </ul>
</div>


  
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
        <embed tplayername="SWF" splayername="SWF"
            type="application/x-shockwave-flash" src="/tagcloud.swf"
            mediawrapchecked="true" pluginspage="http://www.macromedia.com/go/getflashplayer"
            id="tagcloudflash" name="tagcloudflash" bgcolor="#f3f3f3"
            quality="high" wmode="transparent" allowscriptaccess="always"
            flashvars="tcolor=0xbd1016&amp;tcolor2=0x808080&amp;hicolor=0x0065ff&amp;tspeed=100&amp;distr=true"
            height="100%" width="100%">
        </embed>
    </div>
  </div>


</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><section>
本博客由<a href="https://github.com/RoonyLi">李钊</a>维护，欢迎<a href="mailto:lizhao@wisdombud.com">投稿</a>
</section>
<div class="clearfix"></div>
</footer>
  <script src="//libs.baidu.com/jquery/2.0.3/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>



<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<!-- mathjax config similar to math.stackexchange -->

<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [ ['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for(i=0; i < all.length; i += 1) {
            all[i].SourceElement().parentNode.className += ' has-jax';
        }
    });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
</body>
</html>


<a href="https://github.com/wisdombud" target="_blank"><img style="position: absolute; top: 0; left: 0; border: 0;" src="/imgs/forkme_left_green_007200.png" alt="Fork me on GitHub"></a>
