

<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>微信公众号开发 | 技术博客</title>
  <meta name="author" content="Joseph">
  
  <meta name="description" content="部门的技术博客">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="微信公众号开发"/>
  <meta property="og:site_name" content="技术博客"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon" type="image/x-ico">
  <link rel="alternate" href="http://wisdombud.github.io/atom.xml" title="技术博客" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//libs.baidu.com/jquery/1.8.0/jquery.min.js"></script>
</head>


<body>
  <header id="header" class="inner">
<div class="alignleft">
  <h1><a href="/">技术博客</a></h1>
  <h2><a href="/">慧萌信安互联网</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">归档</a></li>
    
	<li> <a href="/atom.xml">RSS</a> </li>
<li> <a title="把这个链接拖到你的Chrome收藏夹工具栏中" href='javascript:(function() {
	function c() {
		var e = document.createElement("link");
		e.setAttribute("type", "text/css");
		e.setAttribute("rel", "stylesheet");
		e.setAttribute("href", f);
		e.setAttribute("class", l);
		document.body.appendChild(e)
	}
 
	function h() {
		var e = document.getElementsByClassName(l);
		for (var t = 0; t < e.length; t++) {
			document.body.removeChild(e[t])
		}
	}
 
	function p() {
		var e = document.createElement("div");
		e.setAttribute("class", a);
		document.body.appendChild(e);
		setTimeout(function() {
			document.body.removeChild(e)
		}, 100)
	}
 
	function d(e) {
		return {
			height : e.offsetHeight,
			width : e.offsetWidth
		}
	}
 
	function v(i) {
		var s = d(i);
		return s.height > e && s.height < n && s.width > t && s.width < r
	}
 
	function m(e) {
		var t = e;
		var n = 0;
		while (!!t) {
			n += t.offsetTop;
			t = t.offsetParent
		}
		return n
	}
 
	function g() {
		var e = document.documentElement;
		if (!!window.innerWidth) {
			return window.innerHeight
		} else if (e && !isNaN(e.clientHeight)) {
			return e.clientHeight
		}
		return 0
	}
 
	function y() {
		if (window.pageYOffset) {
			return window.pageYOffset
		}
		return Math.max(document.documentElement.scrollTop, document.body.scrollTop)
	}
 
	function E(e) {
		var t = m(e);
		return t >= w && t <= b + w
	}
 
	function S() {
		var e = document.createElement("audio");
		e.setAttribute("class", l);
		e.src = i;
		e.loop = false;
		e.addEventListener("canplay", function() {
			setTimeout(function() {
				x(k)
			}, 500);
			setTimeout(function() {
				N();
				p();
				for (var e = 0; e < O.length; e++) {
					T(O[e])
				}
			}, 15500)
		}, true);
		e.addEventListener("ended", function() {
			N();
			h()
		}, true);
		e.innerHTML = " <p>If you are reading this, it is because your browser does not support the audio element. We recommend that you get a new browser.</p> <p>";
		document.body.appendChild(e);
		e.play()
	}
 
	function x(e) {
		e.className += " " + s + " " + o
	}
 
	function T(e) {
		e.className += " " + s + " " + u[Math.floor(Math.random() * u.length)]
	}
 
	function N() {
		var e = document.getElementsByClassName(s);
		var t = new RegExp("\\b" + s + "\\b");
		for (var n = 0; n < e.length; ) {
			e[n].className = e[n].className.replace(t, "")
		}
	}
 
	var e = 30;
	var t = 30;
	var n = 350;
	var r = 350;
	var i = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake.mp3";
	var s = "mw-harlem_shake_me";
	var o = "im_first";
	var u = ["im_drunk", "im_baked", "im_trippin", "im_blown"];
	var a = "mw-strobe_light";
	var f = "//s3.amazonaws.com/moovweb-marketing/playground/harlem-shake-style.css";
	var l = "mw_added_css";
	var b = g();
	var w = y();
	var C = document.getElementsByTagName("*");
	var k = null;
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			if (E(A)) {
				k = A;
				break
			}
		}
	}
	if (A === null) {
		console.warn("Could not find a node of the right size. Please try a different page.");
		return
	}
	c();
	S();
	var O = [];
	for (var L = 0; L < C.length; L++) {
		var A = C[L];
		if (v(A)) {
			O.push(A)
		}
	}
})()    '>High一下</a> </li>

  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div></header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <div class="post-content">
    <header>
      
  
    <h1 class="title">微信公众号开发</h1>
  

      
        <div class="icon"></div>
        <p style="font-family: Helvetica Neue, Helvetica, Arial, "Hiragino Sans GB", sans-serif;">
           <span style=" display: block;  margin: 10px 0; ">
 	时间：<time style="display:inline" datetime="2016-05-20T09:09:41.660Z">2016-05-20</time></span>
        
          <span style=" display: block;  margin: 10px 0; ">作者：谢非</span>
        
      

    </header>
    <div class="entry">
      
        <blockquote>
<p>&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x7C7B;&#x522B;</p>
</blockquote>
<ol>
<li>&#x8BA2;&#x9605;&#x53F7;&#xFF1A;&#x8BA2;&#x9605;&#x53F7;&#x4E3B;&#x8981;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;&#x548C;&#x8D44;&#x8BAF;&#xFF0C;&#x4FA7;&#x91CD;&#x70B9;&#x662F;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;&#x3002;&#x6BCF;&#x5929;&#x53EF;&#x63A8;&#x9001;1&#x6761;&#x6D88;&#x606F;&#x3002;</li>
<li>&#x670D;&#x52A1;&#x53F7;&#xFF1A;&#x670D;&#x52A1;&#x53F7;&#x4E3B;&#x8981;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x4F9B;&#x4E0E;&#x7528;&#x6237;&#x7684;&#x4EA4;&#x4E92;&#x3002;&#x6BCF;&#x6708;&#x53EF;&#x63A8;&#x9001;4&#x6761;&#x6D88;&#x606F;&#x3002;</li>
</ol>
<blockquote>
<p> &#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x5F00;&#x53D1;&#x7684;&#x5206;&#x7C7B;</p>
</blockquote>
<ol>
<li>&#x5FAE;&#x4FE1;&#x5185;API&#x8C03;&#x7528;&#x3002;&#x4F7F;&#x7528;&#x5FAE;&#x4FE1;&#x7684;API&#xFF0C;&#x63D0;&#x4F9B;&#x804A;&#x5929;&#x7A97;&#x83DC;&#x5355;&#x5B9A;&#x5236;&#xFF0C;&#x6D88;&#x606F;&#x7BA1;&#x7406;&#xFF0C;&#x7528;&#x6237;&#x7BA1;&#x7406;&#x7B49;&#x529F;&#x80FD;&#x3002;</li>
<li>&#x5916;&#x90E8;H5&#x5F00;&#x53D1;&#x3002;</li>
</ol>
<blockquote>
<p>&#x5FAE;&#x4FE1;&#x5185;API&#x8C03;&#x7528;</p>
</blockquote>
<p>&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x516C;&#x4F17;&#x53F7;&#x6709;&#x4E0D;&#x540C;&#x7684;API&#x4F7F;&#x7528;&#x9891;&#x7387;&#xFF0C;<br>&#x8BF7;&#x53C2;&#x9605;&#x6587;&#x6863;:<a href="https://mp.weixin.qq.com/wiki/7/85eff372c164ddc66c47777dc972279f.html" target="_blank" rel="external">https://mp.weixin.qq.com/wiki/7/85eff372c164ddc66c47777dc972279f.html</a></p>
<h2 id="api&#x7C7B;&#x522B;"><a href="#API&#x7C7B;&#x522B;" class="headerlink" title="API&#x7C7B;&#x522B;"></a>API&#x7C7B;&#x522B;</h2><ol>
<li>&#x81EA;&#x5B9A;&#x4E49;&#x83DC;&#x5355;<br>&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF1A;<br>&#x81EA;&#x5B9A;&#x4E49;&#x83DC;&#x5355;&#x6700;&#x591A;&#x5305;&#x62EC;3&#x4E2A;&#x4E00;&#x7EA7;&#x83DC;&#x5355;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E00;&#x7EA7;&#x83DC;&#x5355;&#x6700;&#x591A;&#x5305;&#x542B;5&#x4E2A;&#x4E8C;&#x7EA7;&#x83DC;&#x5355;&#x3002;&#x4E00;&#x7EA7;&#x83DC;&#x5355;&#x6700;&#x591A;4&#x4E2A;&#x6C49;&#x5B57;&#xFF0C;&#x4E8C;&#x7EA7;&#x83DC;&#x5355;&#x6700;&#x591A;7&#x4E2A;&#x6C49;&#x5B57;&#xFF0C;&#x591A;&#x51FA;&#x6765;&#x7684;&#x90E8;&#x5206;&#x5C06;&#x4F1A;&#x4EE5;&#x201C;&#x2026;&#x201D;&#x4EE3;&#x66FF;&#x3002;<br>&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x83DC;&#x5355;&#x540E;&#xFF0C;&#x83DC;&#x5355;&#x7684;&#x5237;&#x65B0;&#x7B56;&#x7565;&#x662F;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x8FDB;&#x5165;&#x516C;&#x4F17;&#x53F7;&#x4F1A;&#x8BDD;&#x9875;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4E0A;&#x4E00;&#x6B21;&#x62C9;&#x53D6;&#x83DC;&#x5355;&#x7684;&#x8BF7;&#x6C42;&#x5728;5&#x5206;&#x949F;&#x4EE5;&#x524D;&#xFF0C;&#x5C31;&#x4F1A;&#x62C9;&#x53D6;&#x4E00;&#x4E0B;&#x83DC;&#x5355;&#xFF0C;&#x5982;&#x679C;&#x83DC;&#x5355;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x5C31;&#x4F1A;&#x5237;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x3002;&#x6D4B;&#x8BD5;&#x65F6;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x53D6;&#x6D88;&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x8D26;&#x53F7;&#x540E;&#x518D;&#x6B21;&#x5173;&#x6CE8;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x521B;&#x5EFA;&#x540E;&#x7684;&#x6548;&#x679C;&#x3002;<br>API&#x64CD;&#x4F5C;&#xFF1A;&#x521B;&#x5EFA;&#x5220;&#x9664;&#x67E5;&#x8BE2;&#x81EA;&#x5B9A;&#x4E49;&#x83DC;&#x5355;&#x3002;</li>
<li><p>&#x6D88;&#x606F;&#x7BA1;&#x7406;<br>&#x63A5;&#x6536;&#x666E;&#x901A;&#x6D88;&#x606F;&#xFF1A;&#x6587;&#x672C;&#x6D88;&#x606F; &#x56FE;&#x7247;&#x6D88;&#x606F; &#x8BED;&#x97F3;&#x6D88;&#x606F;  &#x89C6;&#x9891;&#x6D88;&#x606F;<br>&#x63A5;&#x6536;&#x4E8B;&#x4EF6;&#x63A8;&#x9001;&#xFF1A;&#x5173;&#x6CE8;/&#x53D6;&#x6D88;&#x5173;&#x6CE8;&#x4E8B;&#x4EF6;    &#x626B;&#x63CF;&#x5E26;&#x53C2;&#x6570;&#x4E8C;&#x7EF4;&#x7801;&#x4E8B;&#x4EF6;    &#x4E0A;&#x62A5;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4E8B;&#x4EF6;<br>&#x81EA;&#x5B9A;&#x4E49;&#x83DC;&#x5355;&#x4E8B;&#x4EF6;&#xFF1A;&#x70B9;&#x51FB;&#x83DC;&#x5355;&#x62C9;&#x53D6;&#x6D88;&#x606F;&#x65F6;&#x7684;&#x4E8B;&#x4EF6;&#x63A8;&#x9001;    &#x70B9;&#x51FB;&#x83DC;&#x5355;&#x8DF3;&#x8F6C;&#x94FE;&#x63A5;&#x65F6;&#x7684;&#x4E8B;&#x4EF6;&#x63A8;&#x9001;<br>&#x88AB;&#x52A8;&#x56DE;&#x590D;&#x6D88;&#x606F;&#xFF1A;&#x6587;&#x672C;&#x6D88;&#x606F; &#x56FE;&#x7247;&#x6D88;&#x606F; &#x8BED;&#x97F3;&#x6D88;&#x606F;  &#x89C6;&#x9891;&#x6D88;&#x606F;  &#x56DE;&#x590D;&#x97F3;&#x4E50;&#x6D88;&#x606F;<br>&#x5BA2;&#x670D;&#x63A5;&#x53E3;&#xFF1A;&#x5BA2;&#x670D;&#x5E10;&#x53F7;&#x7BA1;&#x7406; &#x6DFB;&#x52A0;&#x5BA2;&#x670D;&#x5E10;&#x53F7;&#xFF08;&#x6BCF;&#x4E2A;&#x516C;&#x4F17;&#x53F7;&#x6700;&#x591A;&#x6DFB;&#x52A0;10&#x4E2A;&#x5BA2;&#x670D;&#x8D26;&#x53F7;&#xFF09; &#x4FEE;&#x6539;&#x5BA2;&#x670D;&#x5E10;&#x53F7;&#x5220;&#x9664;&#x5BA2;&#x670D;&#x5E10;&#x53F7; &#x8BBE;&#x7F6E;&#x5BA2;&#x670D;&#x5E10;&#x53F7;&#x7684;&#x5934;&#x50CF;&#xFF08;jpg&#x683C;&#x5F0F;&#xFF0C;&#x5927;&#x5C0F;640*640&#xFF09; &#x83B7;&#x53D6;&#x6240;&#x6709;&#x5BA2;&#x670D;&#x8D26;&#x53F7;<br>&#x5BA2;&#x670D;&#x63A5;&#x53E3;-&#x53D1;&#x6D88;&#x606F;&#xFF1A;&#x6587;&#x672C;&#x6D88;&#x606F; &#x56FE;&#x7247;&#x6D88;&#x606F; &#x8BED;&#x97F3;&#x6D88;&#x606F;  &#x89C6;&#x9891;&#x6D88;&#x606F;  &#x56DE;&#x590D;&#x97F3;&#x4E50;&#x6D88;&#x606F;    &#x53D1;&#x9001;&#x5361;&#x5238;</p>
</li>
<li><p>&#x9AD8;&#x7EA7;&#x7FA4;&#x53D1;&#x63A5;&#x53E3;&#xFF1A;&#x6587;&#x672C;&#x6D88;&#x606F; &#x56FE;&#x7247;&#x6D88;&#x606F; &#x8BED;&#x97F3;&#x6D88;&#x606F;  &#x89C6;&#x9891;&#x6D88;&#x606F;  &#x56DE;&#x590D;&#x97F3;&#x4E50;&#x6D88;&#x606F; &#x53D1;&#x9001;&#x5361;&#x5238;</p>
</li>
<li>&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF1A;&#x4EC5;&#x7528;&#x4E8E;&#x516C;&#x4F17;&#x53F7;&#x5411;&#x7528;&#x6237;&#x53D1;&#x9001;&#x91CD;&#x8981;&#x7684;&#x670D;&#x52A1;&#x901A;&#x77E5;    &#x5982;&#x4FE1;&#x7528;&#x5361;&#x5237;&#x5361;&#x901A;&#x77E5;&#xFF0C;&#x5546;&#x54C1;&#x8D2D;&#x4E70;    &#x83B7;&#x53D6;&#x6A21;&#x677F;&#x5217;&#x8868;    &#x5220;&#x9664;&#x6A21;&#x677F; &#x8BBE;&#x7F6E;&#x6240;&#x5C5E;&#x884C;&#x4E1A;    &#x83B7;&#x53D6;&#x8BBE;&#x7F6E;&#x7684;&#x884C;&#x4E1A;&#x4FE1;&#x606F; &#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;   &#x83B7;&#x53D6;&#x81EA;&#x52A8;&#x56DE;&#x590D;&#x590D;&#x914D;&#x7F6E;&#x4FE1;&#x606F;</li>
<li><p>&#x7F51;&#x9875;&#x6388;&#x6743;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;    &#x5982;&#x679C;&#x7528;&#x6237;&#x5728;&#x5FAE;&#x4FE1;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x8BBF;&#x95EE;&#x7B2C;&#x4E09;&#x65B9;&#x7F51;&#x9875;&#xFF0C;&#x516C;&#x4F17;&#x53F7;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x6388;&#x6743;&#x673A;&#x5236;&#xFF0C;&#x6765;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x8FDB;&#x800C;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p>
<blockquote>
<p>&#x914D;&#x7F6E;&#x57DF;&#x540D;<br> 1&#x3001;&#x5728;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x8BF7;&#x6C42;&#x7528;&#x6237;&#x7F51;&#x9875;&#x6388;&#x6743;&#x4E4B;&#x524D;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x9700;&#x8981;&#x5148;&#x5230;&#x516C;&#x4F17;&#x5E73;&#x53F0;&#x5B98;&#x7F51;&#x4E2D;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3;&#x9875;&#x914D;&#x7F6E;&#x6388;&#x6743;&#x56DE;&#x8C03;&#x57DF;&#x540D;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x586B;&#x5199;&#x7684;&#x662F;&#x57DF;&#x540D;&#xFF08;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;URL&#xFF0C;&#x56E0;&#x6B64;&#x8BF7;&#x52FF;&#x52A0;http:// &#x7B49;&#x534F;&#x8BAE;&#x5934;&#x3002;<br>2&#x3001;&#x6388;&#x6743;&#x56DE;&#x8C03;&#x57DF;&#x540D;&#x914D;&#x7F6E;&#x89C4;&#x8303;&#x4E3A;&#x5168;&#x57DF;&#x540D;&#xFF0C;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x7F51;&#x9875;&#x6388;&#x6743;&#x7684;&#x57DF;&#x540D;&#x4E3A;&#xFF1A;www.qq.com&#xFF0C;&#x914D;&#x7F6E;&#x4EE5;&#x540E;&#x6B64;&#x57DF;&#x540D;&#x4E0B;&#x9762;&#x7684;&#x9875;&#x9762;<br><a href="http://www.qq.com/music.html&#x3001;http://www.qq.com/login.html" target="_blank" rel="external">http://www.qq.com/music.html&#x3001;http://www.qq.com/login.html</a> &#x3002;<br>3&#x3001;&#x5982;&#x679C;&#x516C;&#x4F17;&#x53F7;&#x767B;&#x5F55;&#x6388;&#x6743;&#x7ED9;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x5219;&#x4E0D;&#x5FC5;&#x505A;&#x4EFB;&#x4F55;&#x8BBE;&#x7F6E;&#xFF0C;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x4EE3;&#x66FF;&#x516C;&#x4F17;&#x53F7;&#x5B9E;&#x73B0;&#x7F51;&#x9875;&#x6388;&#x6743;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4E24;&#x79CD;&#x6388;&#x6743;&#x65B9;&#x5F0F;&#xFF1A;<br> 1&#x3001;&#x4EE5;snsapi_base&#x4E3A;scope&#x53D1;&#x8D77;&#x7684;&#x7F51;&#x9875;&#x6388;&#x6743;&#xFF0C;&#x662F;&#x7528;&#x6765;&#x83B7;&#x53D6;&#x8FDB;&#x5165;&#x9875;&#x9762;&#x7684;&#x7528;&#x6237;&#x7684;openid&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x9759;&#x9ED8;&#x6388;&#x6743;&#x5E76;&#x81EA;&#x52A8;&gt; &#x8DF3;&#x8F6C;&#x5230;&#x56DE;&#x8C03;&#x9875;&#x7684;&#x3002;&#x7528;&#x6237;&#x611F;&#x77E5;&#x7684;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x4E86;&#x56DE;&#x8C03;&#x9875;&#xFF08;&#x5F80;&#x5F80;&#x662F;&#x4E1A;&#x52A1;&#x9875;&#x9762;&#xFF09;<br>2&#x3001;&#x4EE5;snsapi_userinfo&#x4E3A;scope&#x53D1;&#x8D77;&#x7684;&#x7F51;&#x9875;&#x6388;&#x6743;&#xFF0C;&#x662F;&#x7528;&#x6765;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x6388;&#x6743;&#x9700;&#x8981;&#x7528;&#x6237;&#x624B;&#x52A8;&#x540C;&gt;&gt; &#x610F;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x7528;&#x6237;&#x540C;&#x610F;&#x8FC7;&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x987B;&#x5173;&#x6CE8;&#xFF0C;&#x5C31;&#x53EF;&#x5728;&#x6388;&#x6743;&#x540E;&#x83B7;&#x53D6;&#x8BE5;&#x7528;&#x6237;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3002;<br>3&#x3001;&#x7528;&#x6237;&#x7BA1;&#x7406;&#x7C7B;&#x63A5;&#x53E3;&#x4E2D;&#x7684;&#x201C;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x63A5;&#x53E3;&#x201D;&#xFF0C;&#x662F;&#x5728;&#x7528;&#x6237;&#x548C;&#x516C;&#x4F17;&#x53F7;&#x4EA7;&#x751F;&#x6D88;&#x606F;&#x4EA4;&#x4E92;&#x6216;&#x5173;&#x6CE8;&#x540E;&#x4E8B;&#x4EF6;&#x63A8;&#x9001;&#x540E;&#xFF0C;&#x624D;&gt;&gt; &#x80FD;&#x6839;&#x636E;&#x7528;&#x6237;OpenID&#x6765;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x5305;&#x62EC;&#x5176;&#x4ED6;&#x5FAE;&#x4FE1;&#x63A5;&#x53E3;&#xFF0C;&#x90FD;&#x662F;&#x9700;&#x8981;&#x8BE5;&#x7528;&#x6237;&#xFF08;&#x5373;openid&#xFF09;&#x5173;&#x6CE8;&#x4E86;&gt; &#x516C;&#x4F17;&#x53F7;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x8C03;&#x7528;&#x6210;&#x529F;&#x7684;&#x3002;<br>snsapi_userinfo&#xFF0C;&#x4E5F;&#x662F;&#x9759;&#x9ED8;&#x6388;&#x6743;&#xFF0C;&#x7528;&#x6237;&#x65E0;&#x611F;&#x77E5;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x4E09;&#x65B9;&#x9875;&#x9762;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x4FE1;&#x606F;&#xFF1A;<br>&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x7528;&#x6237;&#x540C;&#x610F;&#x6388;&#x6743;&#xFF0C;&#x83B7;&#x53D6;code<br>&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x901A;&#x8FC7;code&#x6362;&#x53D6;&#x7F51;&#x9875;&#x6388;&#x6743;access_token<br>&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;&#x5237;&#x65B0;access_token&#xFF08;&#x5982;&#x679C;&#x9700;&#x8981;&#xFF09;<br>&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x62C9;&#x53D6;&#x7528;&#x6237;&#x4FE1;&#x606F;(&#x9700;scope&#x4E3A; snsapi_userinfo)</p>
</blockquote>
</li>
<li><p>&#x7D20;&#x6750;&#x7BA1;&#x7406;<br>&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF1A;&#x4E34;&#x65F6;&#x7D20;&#x6750;&#x5A92;&#x4F53;&#x6587;&#x4EF6;&#x5728;&#x540E;&#x53F0;&#x4FDD;&#x5B58;&#x65F6;&#x95F4;&#x4E3A;3&#x5929; &#xFF0C;<br>&#x56FE;&#x7247;&#xFF08;image&#xFF09;: 2M&#xFF0C;&#x652F;&#x6301;bmp/png/jpeg/jpg/gif&#x683C;&#x5F0F;<br>&#x8BED;&#x97F3;&#xFF08;voice&#xFF09;&#xFF1A;2M&#xFF0C;&#x64AD;&#x653E;&#x957F;&#x5EA6;&#x4E0D;&#x8D85;&#x8FC7;60s&#xFF0C;&#x652F;&#x6301;AMR\MP3&#x683C;&#x5F0F;<br>&#x89C6;&#x9891;&#xFF08;video&#xFF09;&#xFF1A;10MB&#xFF0C;&#x652F;&#x6301;MP4&#x683C;&#x5F0F;<br>&#x7F29;&#x7565;&#x56FE;&#xFF08;thumb&#xFF09;&#xFF1A;64KB&#xFF0C;&#x652F;&#x6301;JPG&#x683C;&#x5F0F;<br>&#x6C38;&#x4E45;&#x7D20;&#x6750;&#x56FE;&#x6587;&#x6D88;&#x606F;&#x7D20;&#x6750;&#x548C;&#x56FE;&#x7247;&#x7D20;&#x6750;&#x7684;&#x4E0A;&#x9650;&#x4E3A;5000&#xFF0C;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x4E3A;1000<br>API&#x64CD;&#x4F5C;&#xFF1A;&#x65B0;&#x589E;&#x4E34;&#x65F6;&#x7D20;&#x6750;&#x3001;&#x83B7;&#x53D6;&#x4E34;&#x65F6;&#x7D20;&#x6750;&#x3001;&#x65B0;&#x589E;&#x6C38;&#x4E45;&#x56FE;&#x6587;&#x7D20;&#x6750;&#x3001;&#x83B7;&#x53D6;&#x6C38;&#x4E45;&#x7D20;&#x6750;&#x3001;&#x5220;&#x9664;&#x6C38;&#x4E45;&#x7D20;&#x6750;&#x3001;&#x83B7;&#x53D6;&#x7D20;&#x6750;&#x603B;&#x6570;  &#x3001;&#x83B7;&#x53D6;&#x7D20;&#x6750;&#x5217;&#x8868;&#x3002;</p>
</li>
<li><p>&#x7528;&#x6237;&#x7BA1;&#x7406;<br>API&#x64CD;&#x4F5C;&#xFF1A;&#x7528;&#x6237;&#x5206;&#x7EC4;&#x7BA1;&#x7406;&#x3001;&#x521B;&#x5EFA;&#x5206;&#x7EC4;&#x3001;&#x67E5;&#x8BE2;&#x6240;&#x6709;&#x5206;&#x7EC4;&#x3001;&#x67E5;&#x8BE2;&#x7528;&#x6237;&#x6240;&#x5728;&#x5206;&#x7EC4;&#x3001;&#x4FEE;&#x6539;&#x5206;&#x7EC4;&#x540D;&#x3001;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x5206;&#x7EC4;&#x3001;  &#x6279;&#x91CF;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x5206;&#x7EC4;&#x3001;&#x5220;&#x9664;&#x5206;&#x7EC4;&#x3001;&#x8BBE;&#x7F6E;&#x5907;&#x6CE8;&#x540D;&#x3001;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3001;&#x6279;&#x91CF;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3001;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x5730;&#x7406;&#x4F4D;&#x7F6E; &#x3002;</p>
</li>
<li><p>&#x5E10;&#x53F7;&#x7BA1;&#x7406;<br>API&#x64CD;&#x4F5C;&#xFF1A;&#x751F;&#x6210;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#xFF0C;&#x957F;&#x94FE;&#x63A5;&#x8F6C;&#x77ED;&#x94FE;&#x63A5;&#x63A5;&#x53E3;&#xFF0C;&#x5FAE;&#x4FE1;&#x8BA4;&#x8BC1;&#x4E8B;&#x4EF6;&#x3002;</p>
</li>
</ol>
<h2 id="&#x5916;&#x90E8;h5&#x5F00;&#x53D1;"><a href="#&#x5916;&#x90E8;H5&#x5F00;&#x53D1;" class="headerlink" title="&#x5916;&#x90E8;H5&#x5F00;&#x53D1;"></a>&#x5916;&#x90E8;H5&#x5F00;&#x53D1;</h2><p>&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x5F00;&#x53D1;&#x6837;&#x5F0F;&#x5E93; <a href="http://weui.github.io/weui/#/" target="_blank" rel="external">http://weui.github.io/weui/#/</a><br>&#x5FAE;&#x4FE1;JS-SDK&#x8BF4;&#x660E;&#x6587;&#x6863; <a href="http://res.wx.qq.com/open/js/jweixin-1.0.0.js" target="_blank" rel="external">http://res.wx.qq.com/open/js/jweixin-1.0.0.js</a><br>&#x5FAE;&#x4FE1;web&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;  <a href="https://mp.weixin.qq.com/debug/cgi-bin/webdebugger/download?from=mpwiki&amp;os=x64" target="_blank" rel="external">https://mp.weixin.qq.com/debug/cgi-bin/webdebugger/download?from=mpwiki&amp;os=x64</a></p>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/java/">java</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/wechat/">wechat</a>
  </div>

<!-- Baidu Button BEGIN -->
<div id="bdshare" class="bdshare_t bds_tools_32 get-codes-bdshare">
<a class="bds_qzone"></a>
<a class="bds_tsina"></a>
<a class="bds_tqq"></a>
<a class="bds_renren"></a>
<a class="bds_t163"></a>
<span class="bds_more"></span>
<a class="shareCount"></a>
</div>
<script type="text/javascript" id="bdshare_js" data="type=tools&amp;uid=3326447" ></script>
<script type="text/javascript" id="bdshell_js"></script>
<script type="text/javascript">
document.getElementById("bdshell_js").src = "http://bdimg.share.baidu.com/static/js/shell_v2.js?cdnversion=" + Math.ceil(new Date()/3600000)
</script>
<!-- Baidu Button END -->      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>



 <nav id="pagination" >
    
    <a href="/2016/05/20/34.java匿名内部类/" class="alignleft prev" >上一页</a>
    
    
    <a href="/2016/05/17/33.JRebel简介/" class="alignright next" >下一页</a>
    
    <div class="clearfix"></div>
</nav>



<section id="comment">

  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="post-35.微信公众号开发" data-title="微信公众号开发" data-url="http://wisdombud.github.io/2016/05/20/35.微信公众号开发/"></div>

  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"wisdombud"};
  	(function() {
  		var ds = document.createElement('script');
  		ds.type = 'text/javascript';ds.async = true;
  		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  		ds.charset = 'UTF-8';
  		(document.getElementsByTagName('head')[0]
  		 || document.getElementsByTagName('body')[0]).appendChild(ds);
  	})();
  	</script>
  <!-- 多说公共JS代码 end -->


</section>


</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:wisdombud.github.io">
  </form>
</div>

  <div class="widget tag">
<h3 class="title">简介</h3>
<ul class="entry">
<li>慧萌信安</li>
<li>Mis And 互联网</li>
<li></li>
<li>Theme: <a href="https://github.com/zippera/lightum">Lightum</a>
</ul>
</div>


  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/J2EE-web/">J2EE-web</a><small>3</small></li>
  
    <li><a href="/categories/SCM/">SCM</a><small>0</small></li>
  
    <li><a href="/categories/WEB/">WEB</a><small>1</small></li>
  
    <li><a href="/categories/java/">java</a><small>7</small></li>
  
    <li><a href="/categories/javacript/">javacript</a><small>4</small></li>
  
    <li><a href="/categories/javascript/">javascript</a><small>1</small></li>
  
    <li><a href="/categories/log/">log</a><small>1</small></li>
  
    <li><a href="/categories/scm/">scm</a><small>1</small></li>
  
    <li><a href="/categories/web/">web</a><small>2</small></li>
  
    <li><a href="/categories/基础知识/">基础知识</a><small>1</small></li>
  
    <li><a href="/categories/学习/">学习</a><small>1</small></li>
  
    <li><a href="/categories/工具/">工具</a><small>1</small></li>
  
    <li><a href="/categories/常识/">常识</a><small>8</small></li>
  
    <li><a href="/categories/开发工具/">开发工具</a><small>2</small></li>
  
    <li><a href="/categories/数据库/">数据库</a><small>2</small></li>
  
  </ul>
</div>


  
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
        <embed tplayername="SWF" splayername="SWF"
            type="application/x-shockwave-flash" src="/tagcloud.swf"
            mediawrapchecked="true" pluginspage="http://www.macromedia.com/go/getflashplayer"
            id="tagcloudflash" name="tagcloudflash" bgcolor="#f3f3f3"
            quality="high" wmode="transparent" allowscriptaccess="always"
            flashvars="tcolor=0xbd1016&amp;tcolor2=0x808080&amp;hicolor=0x0065ff&amp;tspeed=100&amp;distr=true"
            height="100%" width="100%">
        </embed>
    </div>
  </div>


</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><section>
本博客由<a href="https://github.com/RoonyLi">李钊</a>维护，欢迎<a href="mailto:lizhao@wisdombud.com">投稿</a>
</section>
<div class="clearfix"></div>
</footer>
  <script src="//libs.baidu.com/jquery/2.0.3/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>



<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<!-- mathjax config similar to math.stackexchange -->

<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [ ['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for(i=0; i < all.length; i += 1) {
            all[i].SourceElement().parentNode.className += ' has-jax';
        }
    });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
</body>
</html>


<a href="https://github.com/wisdombud" target="_blank"><img style="position: absolute; top: 0; left: 0; border: 0;" src="/imgs/forkme_left_green_007200.png" alt="Fork me on GitHub"></a>
